{"1": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Artificial Intelligence"], "speakerIds": [94], "description": "Researchers are putting great effort into building socio-therapeutic bots to provide an affordable and 24/7 therapy available to clients with adverse health behaviors. But these bots still lack the ability to communicate like a therapist. Hence, this work is a step towards generating Reflections ñ Restating both the feelings and words of the client in a conversation to make them feel heard.", "name": "I heard you say - Reflection Generation using Variational Auto-Encoder", "type": "Session"}, "2": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Security"], "speakerIds": [90], "description": "Bitcoin facilitates psedoanonymous by allowing clients to broadcast transactions that contain their pseudonym. In this paper, we present an attack that deanonymizes Bitcoin clients in a completely seamless manner. The novel aspect of this attack is that it considers an Internet Service Provider that naturally observes Bitcoin traffic  and thus can neither be noticed nor avoided.", "name": "RaBit: Routing attacks on Bitcoin's Anonymity", "type": "Session"}, "3": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Artificial Intelligence"], "speakerIds": [72], "description": "Achieving highly detailed 3D terrain spanning vast areas is crucial to modern computer graphics. In this paper, we propose generative adversarial terrain amplification that achieves local and global coherence compared to the existing methods. The proposed approach reduces the need for unnecessary manual adjustments, can speed up the development and brings the model quality to a new level.", "name": "Multi-Theme Generative Adversarial Terrain Amplification", "type": "Session"}, "4": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Big Data/Supercomputing, High Performance/Parallel Computing"], "speakerIds": [454], "description": "Community detection in graphs is a computationally challenging problem and an important application is preventing epidemic spreading, very useful in current COVID-19 situation.We present a scalable method for detecting communities using GCN via semi-supervised node classification.We use PyTorch with CUDA on GPU.Our model achieves up to 86.9% accuracy.We accelerate the model performance 4x with GPU", "name": "Preventing Epidemic Spreading by Community Detection with Semi-supervised Node Classification on GPU", "type": "Session"}, "5": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Human Computer Interaction"], "speakerIds": [265], "description": "Students learn by teaching and the learning happens when the tutor engages in knowledge-building activities. Students easily engage in such activities when they are explicitly asked by a domain expert. The current global pandemic made face to face human meetups difficult. Therefore, we present a complete model of a teachable agentís question prompts that facilitates tutor learning.", "name": "Tutee agent's dialog model that enhances tutor's knowledge building activities to aid tutor learning", "type": "Session"}, "6": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Human Computer Interaction"], "speakerIds": [310], "description": "With increased online shopping and content consumption, the demand for recommender systems is more than ever before. We introduce a new approach to recommender systems that takes into account psychological biases and personal characteristics of consumers. Adding these factors helps understand how consumers interact with recommender systems, and is informative for interface designers.", "name": "Personality and Anchoring in  Recommender Systems", "type": "Session"}, "7": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Cloud Computing"], "speakerIds": [1], "description": "The pandemic lockdown have spurred more remote work, virtual collaboration & video streaming traffic. This surge initiates a shift towards edge computing, facing challenges of resource assignment & load balancing. Dynamic service migration addresses such issues & evaluation is based on app QoS, avg system response and migration cost for load, compute resources, inter-edge bandwidth & user latency.", "name": "Shared Resource Dynamic Migration Framework to Support Current Traffic Volume in Edge-Computing", "type": "Session"}, "8": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [411], "description": "During COVID-19, our reliability on networks and systems has increased manifolds with high volatility in the markets and people working remotely. Along with it there has been unprecedented increase in cyber threats. It has become more critical than ever to make our systems more stable & secure. LogSense uses novel Machine Learning approach to predict outages/incidents using Log Analytics", "name": "LogSense: Let AI Monitor your Application Health", "type": "Session"}, "9": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Security"], "speakerIds": [236], "description": "With remote work becoming the new norm, cyber attackers are leveraging the pandemic as an opportunity to attack individuals and organizations. It has become imperative to update security measures in this constantly evolving threat landscape. In this poster, we discuss an early warning system focused on temporal analysis of malware communications to identify early indicators of an infection.", "name": "Towards Identifying Early Indicators of a Malware Infection", "type": "Session"}, "10": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Biotechnology/Bioinformatics, Health Sciences, Computational Biology"], "speakerIds": [44], "description": "A number of methods in biology are confounded by zero inflation, where measured zero values can represent either true or false negatives.  We successfully applied a recommender system based on weighted non-negative matrix factorization to recover missing values in single-cell RNA-Sequencing data. The approach will also be useful for modeling rates of cancer or infectious diseases like COVID-19.", "name": "Matrix Factorization for zero inflation problem in scRNA-seq and sparse data sets in medical biology", "type": "Session"}, "11": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [204], "description": "We build a competition autoencoder-based topic model in which a constraint is put on hidden layers to choose features based on the competition among the strongest and weakest neurons (Second Chance Autoencoder). This model can be used for extracting concern people share in social media regarding COVID-19. Given those concerns, we can prepare society for the future when a similar pandemic occurs.", "name": "Second Chance Autoencoder for Textual Data", "type": "Session"}, "12": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Big Data/Supercomputing, High Performance/Parallel Computing"], "speakerIds": [428], "description": "Large datasets and novel Deep Neural Networks have increased the computational complexity to a point that impels parallelism and distributed computing. We propose a new backend for Keras which allows computations to be passed to execution graphs to the High-Performance ParalleX runtime for optimization and scalability. We exemplify the viability of our proposal using two inference applications.", "name": "A Deep Learning High-Performance Backend", "type": "Session"}, "13": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [142], "description": "Prediction model for COVID-19 pandemic to forecast the pandemic spread and to take relevant measures to control the pandemic has become a need of the hour due to global uncertainty. Predictive Modeling helps to predict the pandemic spread and to know the rate of infections, deaths and recovery across the globe. In the proposed model, Machine Learning is applied for outbreak prediction and impact.", "name": "Predictive Model for COVID-19 Pandemic spread using Machine Learning", "type": "Session"}, "14": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Security"], "speakerIds": [404], "description": "COVID-19 outbreak has brought privacy and surveillance concerns to the forefront.To address this issue, we introduce a user-centric privacy dashboard with a feature of privacy score. We believe that if users are aware of the spread of their existing digital footprint, it will lead them to make better decisions in sharing information and facilitate trust with an organization.", "name": "User-Centered Privacy Dashboard - A tool for Digital Privacy awareness", "type": "Session"}, "15": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Human Computer Interaction"], "speakerIds": [415], "description": "It is important to give all the technical interview candidates an equal chance of being successful, especially women and minorities.  COVID-19 may force companies to migrate solely to online technical interviews. My research focuses on finding effective interventions that can make new forms of technical interviews all-inclusive and plausible for both companies and candidates.", "name": "Building Future of Technical Interviews", "type": "Session"}, "16": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Databases/Information Retrieval/Data Mining"], "speakerIds": [3], "description": "In the internet age, radicalization largely occurs via social networking platforms such as YouTube, Twitter, Facebook, etc. Given increased screen times amid people staying at home due to COVID-19, this can be problematic. This study shows that a non-radical Twitter account can follow a pathway to radicalization. People may migrate towards the more radicalized Alt-right white nationalist ideas.", "name": "Investigating Radicalization on Twitter", "type": "Session"}, "17": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Human Computer Interaction"], "speakerIds": [407], "description": "Big data is an increasingly valuable commodity allowing us to derive new insights from data sets that have been stitched together.  But UX has traditionally been either excluded or brought in to design the data outputs, only after the data lake has already been built.  Can UX add value to the design and build of the data lake itself? Come hear arguments for why I believe the answer is yes.", "name": "Data Is the New Oil - Does UX Have a Play?", "type": "Session"}, "18": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Biotechnology/Bioinformatics, Health Sciences, Computational Biology"], "speakerIds": [412], "description": "This work highlights a computationally powerful, custom-made research platform for testing Cochlear-Implant (CI) and Hearing aid (HA) algorithms. It offers researchers in the CI/HA space flexibility to modify sound processing parameters real-time in naturalistic environments using user-friendly, software-mediated open-source tools, aiming at restoring hearing capability in profoundly deaf people.", "name": "Portable Real-time Testing Platform for Cochlear Implant and Hearing aid algorithms", "type": "Session"}, "19": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Data Science"], "speakerIds": [31], "description": "Due to the COVID-19, a lot of students stay at home learning with the ITS, while many of them lack the supporting devices, e.g., camera, etc. Given the missingness in data, it is hard for the tutor to accurately predict the studentsí learning performance to provide personalized feedbacks. To handle such block-wise missingness, we propose a PRIME algorithm to maximally utilize all available data.", "name": "Missingness Handling in Intelligent Tutoring Systems to Predict Students' Learning Performance", "type": "Session"}, "20": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Robotics"], "speakerIds": [497], "description": "In the case of a pandemic, the AI comes to help people. In a coronavirus lockdown, many autonomous vehicles around the world fight against the virus in transporting the medical supply, cleaning, and disinfecting the public places. In his work, we focus on providing the novel approach to control the robot using landmarks through linear optimization which has the application on autonomous vehicles.", "name": "Robust Path Planning and Control For Polygonal Environments via Linear Programming", "type": "Session"}, "21": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Natural Language Processing"], "speakerIds": [324], "description": "Education has changed dramatically, with the distinctive rise of online learning due to Coronavirus outbreak. Lack of student-instructor interaction is among many pedagogical challenges students are facing. We propose to tackle this by automatically identifying posts that express confusion or urgency from discussion forums using a multitask learning approach to leverage shared information.", "name": "Multi-task Learning for Effective Forum Curation in Online Learning", "type": "Session"}, "22": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Robotics"], "speakerIds": [460], "description": "Novel advances in wearable technology are bringing us to a new era of ubiquitous possibilities such as invaluable assistance for elderly patients. However, current research over wearable data has focused on resource-intensive methods neglecting the constraints of this technology. Therefore, we tackle these constraints by generating data in order to impact the elderly and disabled daily life.", "name": "Overcoming Wearable Constraints for Elderly Aid", "type": "Session"}, "23": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Software Engineering"], "speakerIds": [256], "description": "The proliferation of mobile devices has imposed new privacy concerns for end-users and engineering challenges for app developers. To address these challenges, we present a methodology that is aimed for establishing a crowd-driven framework for externalizing, classifying, and modeling users privacy concerns in Health and Education applications which are widely used due to the COVID-19 pandemic.", "name": "Modeling Privacy Concerns in the Mobile App Market: A Case of Educational and Health Apps", "type": "Session"}, "24": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Human Computer Interaction"], "speakerIds": [406], "description": "ExperiMan is a programming language for online behavioral experiments that addresses the replicability crisis in the social sciences. ExperiMan generates statistically sound experiments and runs them on MTurk, maximizing response quality and minimizing time and cost. Experiments are encoded with an easy-to-use interface, suitable for researchers with little to no computer science training.", "name": "ExperiMan: Automatically Correct and Replicable Online Experiments", "type": "Session"}, "25": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Biotechnology/Bioinformatics, Health Sciences, Computational Biology"], "speakerIds": [67], "description": "Tackling complexities of drug discovery accelerates availability of drugs and contributes to the well-being of society for unmet needs in outbreak of a disease. We showcase integration of machine learning in quantitative systems pharmacology as part of the drug development pipeline. Results demonstrate the potential in expediting and optimizing the application of modeling in drug development.", "name": "Machine Learning in Drug Development to Accelerate Quantitative Systems Pharmacology Modeling", "type": "Session"}, "26": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Human Computer Interaction"], "speakerIds": [444], "description": "Culture defines values and behaviors: what catches our attention, elements that invoke trust, ways we search, what we consider relevant, and triggers that provoke actions. Globalization raises consumersí expectations that theyíll be served locally in a more intimate, personal, and culturally relevant way. Culture dictates consumersí values, behaviors, and expectations. We must design with intent.", "name": "Designing with Intent", "type": "Session"}, "27": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [273], "description": "Concussions are common cognitive impairments, but their effects on driving are not well understood. We studied concussed driving in a virtual reality setting, which is practical when COVID-19 limits accessibility to clinicians. Using convolutional neural networks, we accurately classified concussed driving and extracted interpretable micro-behaviors, which can also be applied to other impairments.", "name": "Using Machine Learning to Understand Post-concussion Driving in a Virtual Reality Setting", "type": "Session"}, "28": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Biotechnology/Bioinformatics, Health Sciences, Computational Biology"], "speakerIds": [349], "description": "The availability and ease of immune profiling has allowed for an increase in multi-omic immunonlogical data. A deeper understanding of these data is crucial in decoding the population's heterogeneic immune response to infection and treatment especially concerning pandemics such as COVID-19.  To do so, we propose to analyze this multi-omic data using a more integrative and computational pipeline.", "name": "A multi-omic approach to assessing drivers of immune variation in healthy individuals", "type": "Session"}, "29": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [70], "description": "We are experiencing a critical situation due to the pandemic and societal changes over racism. It is critical to understand the spirit of our times and take action proportionately. Hence, we need computational platforms that are able to harness text to distill sentiments around social justice incidents and leverage latent fine-grained emotions propagated through different social media platforms.", "name": "Emotional-Psychological Models for Effective, Contextualized Human-Machine Communication", "type": "Session"}, "30": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [183], "description": "Urgent safety measures imposed due to COVID-19 have caused many people to be remotely stranded, away from loved ones. This work presents a CNN based neural style transfer approach to allow stories to be narrated in parentís voices given a sample recording. User audios are converted to spectrograms, the style of which is transferred to the spectrogram of a base voice narrating the story.", "name": "Neural Style Transfer for Personalized Audio Stories", "type": "Session"}, "31": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Emerging Technology"], "speakerIds": [360], "description": "The poster will highlight methods to identify and develop 5G and MEC usecases, and dwells deep into 5G currencies, examples of validated 5G/MEC use cases beyond high bandwidth consumption and best practices to develop them. The audience will gain insights on how 5G can tackle remote system access issues prominent during Covid-19 and address social disparities by promoting tech inclusion.", "name": "Identifying and developing 5G use cases - Enterprise and Consumer", "type": "Session"}, "32": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Natural Language Processing"], "speakerIds": [63], "description": "Images represent things in a way that is universal across languages, and therefore may be used to learn translations of words. In this work we use images as an interlingua to create an unsupervised mapping between monolingual linguistic spaces through visual space. Notably this allows us to map training vocabulary into a much larger cross-lingual semantic space.", "name": "Unsupervised Word Translation Through Images Using Invertible Mappings", "type": "Session"}, "33": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Software Engineering"], "speakerIds": [219], "description": "Learn how to create unified components that are structured in a PnP model. While there are readily available open-source projects, it is difficult to get technologies to work together cohesively, which is critical during a pandemic when changes are needed rapidly. Our proposal demonstrates how to leverage React reusable PnP components to drastically reduce design and development time.", "name": "Achieving UI Development Efficiencies during a Pandemic - Reusable Plug and Play Model Architecture", "type": "Session"}, "34": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [177], "description": "We introduce the attention mechanism to generative adversarial network and propose a novel spatial attention GAN model (SPA-GAN) for image-to image translation. SPA-GAN can be used in synthetizing chest X-ray COVID-19 images to generate a significant number of radiographic images in a short time. Obtaining a sufficient number of training data can improve the accuracy of COVID-19 detection models.", "name": "Spatial Attention GAN for Unsupervised Image-to- Image Translation", "type": "Session"}, "35": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Security/Privacy"], "speakerIds": [251], "description": "Over 90% of cyber attacks involve human error. Furthermore, social engineering attacks, such as email phishing, saw concerning spikes during the pandemic. To make matters worse, AI-enabled attacks like intelligent phishing and DeepFake vishing are making it harder for humans to avoid attacks. During this session you'll learn how hackers use AI to outsmart users, and how the industry can respond.", "name": "Artificial Intelligence Weaponized for Cyber Attacks: Do Humans Stand a Chance?", "type": "Session"}, "36": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Computer Architecture and Hardware Engineering"], "speakerIds": [477], "description": "Adaptability in our devices is key in facing new demands like those sparked by COVID-19. This work exhibits the process of situationally accelerating functions through translation to hardware, using open-source tools and reconfigurable devices. Our implementation of a combinatorial sequence generator for a RISC-V processor shows how a reasonable translation process leads to significant speedup.", "name": "A Hardware Engine for Generating Number-Theoretic Sequences", "type": "Session"}, "37": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [73], "description": "The risk of recidivism is considered when sentencing criminal defendants. While Machine Learning algorithms have been deployed to calculate this risk, the racial fairness of these algorithms is unclear. Replicating prior work, we evaluate different definitions of fairness. We additionally demonstrate how racially-aware predictors could be used to achieve fairness with minimal effects on accuracy.", "name": "Optimizing for Fairness in Recidivism Prediction Instruments", "type": "Session"}, "38": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Emerging Technology"], "speakerIds": [492], "description": "The land of cryptocurrencies and blockchains can be overwhelming: Bitcoin, Ethereum, new chains, forks... Even with a blockchain chosen, should you contribute to the protocol itself or build apps on top of it? This talk aims to give a birdís eye view of the current cryptocurrency landscape, and help find a project that lets you make impact internationally no matter where you are.", "name": "Demystifying Cryptocurrencies & Finding Impact in Blockchain Projects", "type": "Session"}, "39": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [440], "description": "EEG monitoring in rodent disease models of epilepsy is critical in the understanding of disease mechanism and drug development. However, the visual annotation of EEG traces is time-consuming. In this study, we present a random forest-based seizure detection algorithm to detect seizures in multiple mouse models of epilepsy. This algorithm will assist researchers in analyzing seizures in EEG faster.", "name": "Random Forest-based Seizure Detection Algorithm in Heterogeneous Mouse Models of Epilepsy", "type": "Session"}, "40": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Emerging Technology"], "speakerIds": [434], "description": "Blockchain, the technology underlying buzzword laden terms such as Bitcoin and cryptocurrency, is finally getting recognized for its enterprise applicability for solving a variety of complex problems using its immutable distributed ledger. Letís look at a real-world, enterprise use-case where we built an electric vehicle renewable energy usage engine and the lessons learned.", "name": "From Buzzword to Business Implementation: Enterprise Application of Blockchain Technology", "type": "Session"}, "41": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Data Science"], "speakerIds": [49], "description": "In finance, an outlier can represent a big opportunity, or it's an error that drives misinformed investor decisions. Distributions of financial data vary, so we implemented a hybrid statistical system to flag outliers in real time, mimicking quant methodology use to predict trends in financial instruments. Within the first month of implementation, data quality increased from 95.5% to 98.6%.", "name": "Rising to the Equation: Algorithmic Approaches to Data Quality", "type": "Session"}, "42": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Data Science"], "speakerIds": [423], "description": "Combining computer vision techniques, high-speed cameras, pressure-sensitive paint and a transonic wind tunnel, NASA studies unsteady aerodynamic forces on the Space Launch System rocket with unprecedented temporal and spatial resolution. NASAís most powerful supercomputer, Pleiades, enables real-time visualization and parallel processing to investigate buffet forces and aeroacoustic physics.", "name": "One Giant Leap for Womankind: Studying NASA's SLS Rocket With Pressure-Sensitive Paint", "type": "Session"}, "43": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Data Science"], "speakerIds": [37], "description": "Clickstream data has been widely used in e-commerce to better understand user behavior. However, its potential in online banking hasn't been fully explored. In this paper, we present a systematic analysis on how clickstream data can help the banking industry provide better customer experiences by converting data into business value and opportunity, especially during the COVID-19 global pandemic.", "name": "Changing Banking for Good With Clickstream Data", "type": "Session"}, "44": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Computer Architecture and Hardware Engineering"], "speakerIds": [336], "description": "High-level functional language features aid efficient generation of pre-configured Intellectual Property (IP) in hardware design, and partial evaluation specializes IPs at compile time rather than run time. We utilize these tools to implement CORDIC and Viterbi algorithms in both Haskell and Kansas Lava and compare our FPGA synthesized designs with Xilinx Vivado IP and equivalent open-source VHDL.", "name": "Efficient IP Generation from Functional Hardware Description Languages", "type": "Session"}, "45": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Software Engineering"], "speakerIds": [301], "description": "Scaling computationally expensive Monte Carlo simulations in finance incurs large hardware and software costs. We propose using Machine Learning techniques to build high-performance surrogate models that can replace Monte Carlo simulations. Our initial results on Time-Dependent Heston Model show this technique can provide significant performance improvements in pricing large portfolios.", "name": "Surrogate Models for Monte Carlo Simulations in Finance", "type": "Session"}, "46": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Biotechnology/Bioinformatics, Health Sciences, Computational Biology"], "speakerIds": [410], "description": "Decades of studies on sleep have confirmed that sleep irregularity affects the physiological and emotional well-being, which makes it extremely important to be assessed and further analyzed. In this work, We introduce a lightweight and all-textile sleep mask, PhyMask, that can continuously and simultaneously measure eye parameters (EOG), cardiac and respiratory rhythm, and sleep posture.", "name": "PhyMask: Sensing of Physiological Signals During Sleep with All-textile Eyewear", "type": "Session"}, "47": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Artificial Intelligence"], "speakerIds": [294], "description": "The use of machine learning (ML) in higher education can promote studentsí success by identifying who needs help early. Prior research used institutional data, but we showed adding course data could improve prediction. We trained seven ML models and identified 90% of future failures at week nine. The model can be used to help students particularly in the current online learning environments.", "name": "How Machine Learning Identifies Struggling College Students Early and Helps Them Succeed", "type": "Session"}, "48": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Security"], "speakerIds": [367], "description": "Recently a lot of Distributed Denial of Service attacks have been taking place against high-profile targets. To defend this situation, proxy-based network architectures have been implemented to manage the unexpected incoming traffic. In this paper, we propose an authentication technique to verify each request arriving at a proxy server to be checked by a unique tag, generated by the Load-Balancer.", "name": "An Authentication Technique to Handle DDoS Attacks in Proxy-Based Architecture", "type": "Session"}, "49": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Human Computer Interaction"], "speakerIds": [], "description": "We describe how patterns across distinct modalities (speech rate, body movement, and user interface activity) during a computer-mediated collaborative task can be used to predict team performance in real-time using Multidimensional Recurrence Quantification Analysis. Implications for learning, assessment, and operational practice in complex, real-world settings and diverse groups are discussed.", "name": "United We Stand, Divided We Fall! Diverse Modes of Coordination in the Age of Online Learning", "type": "Session"}, "50": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Human Computer Interaction"], "speakerIds": [264], "description": "See how Intuit uses Agile tools and methodologies to empower employees to incorporate accessibility in the process of delivering a product. Accessibility awareness needs to happen from requirements to design to development to release. We will explore the use case of automated conversational UI, which is in heavy demand with the reduction of call centers due to COVID-19.", "name": "Empower Employees In an Agile World to Deliver Accessible Products", "type": "Session"}, "51": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Natural Language Processing"], "speakerIds": [374], "description": "Speech emotion recognition by machine is a difficult task due to the dynamic and uncertain nature of voice data. The gender of the speaker also affects the extracted features. We find the gender-dependent emotion detection model to increase the accuracy of the gender-independent emotion detection model by 2.9% to 5.3% for UWA and 3.4% to 5.8% for WA with high accuracy of gender detection 97%.", "name": "Impact of Biological Gender on Emotion Detection in Voice Data", "type": "Session"}, "52": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Cloud Computing"], "speakerIds": [115], "description": "GameCache is a system that achieves high performance for game analytics with the minimum cost. The main idea is to launch speculative tasks, dispatch the tasks to different resources and cache the results for fast retrieving.  GameCache is light-weight and adaptive to most data processing systems.  GameCache is evaluated with 36% higher performance and 30% less cost than current systems.", "name": "GameCache: Cost-Effective Speculative Caching of Game Metrics", "type": "Session"}, "53": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Networks"], "speakerIds": [493], "description": "NetCHASM, is an open-sourced health checking module used in Verizon Mediaís global load balancer. With Content Distribution Networks widespread, it is vital to know the status of the distributed servers, NetChasm solves this by checking and reporting the server status at regular intervals. It overcomes problems from other softwares by being modular and supporting different types of health checks.", "name": "Network Coordinated Health and Status Monitor", "type": "Session"}, "54": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Software Engineering"], "speakerIds": [326], "description": "Bloomberg provides analytics and trading tools that display real-time pricing and market data for securities. It allows clients to perform real-time searches across a universe of securities based on arbitrary criteria. Our system must be able to process high volumes of market data in real-time, and to support full SQL search. Therefore, an in-memory database is a good fit for our use case.", "name": "Set Your Application on Fire with Apache Ignite", "type": "Session"}, "55": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Artificial Intelligence"], "speakerIds": [168], "description": "Most of the state-of-the-art segmentation deep neural networks(DNNs) often requires a myriad of labor-intensive and expensive manual annotations from skilled biologists. Our work proposes a novel framework to run DNN with zero human effort. We first use an iterative training process to improve segmentation quality. Then introduce a background boosting technique to further enhance the accuracy.", "name": "Toward Zero Human Efforts: Iterative Training Framework for Noisy Segmentation Label", "type": "Session"}, "56": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Natural Language Processing"], "speakerIds": [100], "description": "We investigate the temporal dynamics of the universal task of producing free associations. We implement a computational model that combines representations from three embedding models with a spreading activation framework. We use the Small World of Words dataset to analyze responses and latencies and show that combining semantic structure and dynamic processes optimally explains human behavior.", "name": "Modeling Free Associations Using Distributional Semantic Models and Spreading Activation", "type": "Session"}, "57": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [385], "description": "Current therapeutics discovery lacks a systematic procedure making finding a new drug a lot more time-consuming, specially at a time of crisis. A mathematical systematic approach based on probabilistic generative models is investigated in this work. Specifically we modeled the patterns of proteins forming a potential trapeutic as a hidden variable in a latent variable model.", "name": "A Generative Model for Novel Protein Design", "type": "Session"}, "58": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Software Engineering"], "speakerIds": [490], "description": "Using feature toggles allows developers to turn a feature on or off with a variable in a conditional statement. Using them inappropriately may cause code complexity and dead code. The goal of this project is to aid developers in the use of feature toggles through an empirical study of feature toggle practice usage in industry. As a result, we identified 17 practices and their usage frequencies.", "name": "Software Development with Feature Toggles: Practices used by Practitioners", "type": "Session"}, "59": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Biotechnology/Bioinformatics, Health Sciences, Computational Biology"], "speakerIds": [], "description": "Synovial Sarcoma- malignant tumors of synovial cancer. The pathological feature and other factors (age,gender,tumor size,types) have an inverse relation with the yes-associated protein (YAP)activity obtained from nuclear staining. The analysis indicated low or no YAP in tumors that are more than or equal 5cm is associated with better survival, and the YAP activity score is associated YAP staining.", "name": "Levels of Nuclear YAP Staining Correlation in Synovial Sarcoma Patients", "type": "Session"}, "60": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Databases/Information Retrieval/Data Mining"], "speakerIds": [7], "description": "Biased data-driven decision making harms individuals, and machine learning techniques are blamed for escalating this issue. For instance, clicks collected by recommendation systems suffer from biases that result in poor performance and social justice issues such as gender or race bias through unfair recommendations. Here, we propose approaches that are robust to position and selection bias.", "name": "Removing Bias in Recommender Systems", "type": "Session"}, "61": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Biotechnology/Bioinformatics, Health Sciences, Computational Biology"], "speakerIds": [198], "description": "As the COVID-19 pandemic spreads worldwide, it significantly increases the load on the ICU nurses, many of them are women. This challenge can be mitigated by performing autonomous monitoring of ICU patients to predict adverse physiological events e.g. hypotension. Here, we utilize machine learning algorithms to predict hypotensive events by using only 5 minutes of patients' physiological history.", "name": "Early Prediction of Hypotension: Improving the Quality of Care in the ICU During COVID-19 Pandemic", "type": "Session"}, "62": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Natural Language Processing"], "speakerIds": [238], "description": "News websites are important online resources that constantly compete with each other in reporting events and breaking news. The importance of ranking them based on aspects that help users choose between different news sources, specially during critical times such as the Covid19 Pandemic is becoming more essential. In this article, a framework for ranking news websites based on UGC is proposed.", "name": "Online News Media Website Ranking Using User Generated Content", "type": "Session"}, "63": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Computer Architecture and Hardware Engineering"], "speakerIds": [386], "description": "An efficient and reliable MLC STT-RAM is proposed based on a Drop Approach for COVID-19 dataset.Since CNN models are rather robust, less important bits are dropped, allowing important bits to be written in reliable SLC mode. Experimental results show our approach provides comparable to error-free scenario reliability level, while doubling the bandwidth and maintaining error rate of less than 0.02%", "name": "A Lightweight Reliability Enhancement Scheme for MLC STT-RAM based CNN Accelerators", "type": "Session"}, "64": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Security"], "speakerIds": [362], "description": "As crowdsourcing is becoming widely used for annotating data, attackers have incentives to manipulate the system by intentionally report incorrect information to mislead the system. In this paper, we propose solutions to enhance the robustness of existing truth inference methods base on augmenting the answers and enhancing inference method with a stronger prior.", "name": "Robustness in Truth Inference under Data Poisoning Attacks", "type": "Session"}, "65": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Software Engineering"], "speakerIds": [137], "description": "Mobile app developers commonly utilize analytic services to analyze their app users' behavior. However, developers can misconfigure the services and expose personal information to privacy risk. To study this issue, we developed the Privacy-Aware Analytics Misconfiguration Detector (PAMDroid). Among the 1,000 top apps using top analytic services, PAMDroid found misconfigurations in 120 apps.", "name": "How Does Misconfiguration of Analytic Services Compromise Mobile Privacy?", "type": "Session"}, "66": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Computer Systems Engineering"], "speakerIds": [418], "description": "Google searchís serving infrastructure has evolved radically to power the search engineís growth. Weíll explore how it has tackled sweeping challenges, from latency and explosion of the web at the onset, to modern obtrusive problems like the death of Mooreís law and intricacies of handling private user data, while keeping up with the need of the hour, like supporting Google's response to Covid-19", "name": "Google Searchís Serving Infrastructure: Twenty Years of Powering Web Search for the Planet", "type": "Session"}, "67": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [146], "description": "Public sector industries like tax agencies struggle to cut down their losses due to uncollected revenue. Especially during a pandemic like COVID. The paper focuses on how to gain insights into taxpaying behaviors using transactional and environmental data. Different classification algorithms are studied which assign a risk score to each taxpayer and helps authorities make informed decisions.", "name": "Prediction of Debtors in Public Services", "type": "Session"}, "68": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Artificial Intelligence"], "speakerIds": [208], "description": "AI driven speech synthesis solutions are more important than ever during the COVID-19 pandemic as recording speech in studios has become a challenge. We propose a method to transfer prosody from reference speech to synthesized speech. We incorporate pitch and loudness of reference speech in a neural text-to-speech synthesizer and show that synthesized speech is natural and prosody is transferred.", "name": "Prosody Transfer in Neural Text to Speech Using Global Pitch and Loudness Features", "type": "Session"}, "69": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Human Computer Interaction"], "speakerIds": [213], "description": "Machine Learning is not accessible to young learners given its requirement for heavy math and computation skills. SmileyCluster introduced a hands-on and collaborative learning environment that utilizes glyph-based data visualization and superposition comparative visualization to assist clustering learning. Join us to demystify the SmileyCluster and contribute to the development of the system.", "name": "Demystifying SmileyCluster: Accessible Machine Learning for K-12 Students", "type": "Session"}, "70": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Computer Science Education, Broadening participation in computer science"], "speakerIds": [300], "description": "The project develops partnership among researchers and community stakeholders for a sustainable smart community ecosystem. Leveraging the community broadband that provides affordable Internet access to vulnerable populations, it aims to improve digital inclusion, enhance awareness of socio-technical issues, and seek solutions for challenges in national priority areas (e.g., healthcare, education).", "name": "Broadening Participation in Smart Community to Promote Digital Inclusion", "type": "Session"}, "71": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [375], "description": "The purpose of this study is to implement a deep-learning-based computational model to capture the spatiotemporal imaging feature changes of bilateral breast tissue over four longitudinal negative/benign screening mammogram examinations, for predicting breast cancer risk in a case-control setting. This work can be leveraged to diagnose the development of Covid-19 Using longitudinal lung data.", "name": "Analyzing Temporal Changes in Longitudinal Screening Medical Images", "type": "Session"}, "72": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Biotechnology/Bioinformatics, Health Sciences, Computational Biology"], "speakerIds": [426], "description": "Multiple Sclerosis (MS) is one of the most common neurological conditions worldwide with mobility limitations as one of the earliest and most frequent of all symptoms. This work is the first attempt to demonstrate the potential of machine learning to classify individuals with MS from controls using characteristic gait parameters. The results have future implications for early MS diagnosis.", "name": "Predicting Multiple Sclerosis from Dynamics of Gait Variability", "type": "Session"}, "73": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [350], "description": "While the pandemic raises concerns about the stock market, we present a technique for improving profit from stock transactions and hence incentivizing the investors.Our deep learning system predicts stock prices anda profit-maximization strategy uses these predictions to enhance the profit. These techniques can be applied to time series data related to COVID19 to make future predictions.", "name": "Enhancing Profit from Stock Transactions using Neural Network-Based Time Series Predictions", "type": "Session"}, "74": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Biotechnology/Bioinformatics, Health Sciences, Computational Biology"], "speakerIds": [136], "description": "Septic shock is the most severe stage of Sepsis that has a high mortality rate. However, timely diagnosis and rapid treatment can increase the chance of survival. The Global Sepsis Alliance have announced that COVID-19 can lead to sepsis. In this study, we demonstrate the superiority of Variational Recurrent Neural Network (VRNN) in early prediction of septic shock up to 48 hours before the onset.", "name": "Variational Recurrent Neural Network for Septic Shock Early Prediction", "type": "Session"}, "75": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Natural Language Processing"], "speakerIds": [225], "description": "Our team supports live chat and chatbots on IBM webpages, and wanted to focus on how customers interact with a virtual agents vs humans. In order to analyze these conversational interfaces, we created a transcript analysis platform to summarize our transcripts by applying Machine Learning. With this platform, we were able to immediately identify topics better suited for chatbots, such as COVID-19.", "name": "Am I Talking to a Robot? How Conversations with Chatbots Differ from Human Chats", "type": "Session"}, "76": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Biotechnology/Bioinformatics, Health Sciences, Computational Biology"], "speakerIds": [309], "description": "Single Particle Tracking plays an essential role in the study of biomolecules, especially under the COVID-19 epidemiological situation. In this work, we develop algorithms for simultaneous localization and parameter estimation, then compare our methods to standard approaches through simulation, showing that our methods outperform existing methods in terms of localization and parameter estimation.", "name": "Simultaneous Localization and Parameter Estimation for SPT in Confined Environments", "type": "Session"}, "77": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Human Computer Interaction"], "speakerIds": [249, 489], "description": "The user is a key component of good UI design. However, it often gets overshadowed by business decisions or engineering choices during the development process. This is especially apparent in existing legacy systems. In this poster we show the process that we came up with to put users back in charge of UI development decisions and how that helped us to bring our legacy UI to the 21st century.", "name": "From Legacy to Modern UI: UX Driven Development", "type": "Session"}, "78": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Artificial Intelligence"], "speakerIds": [124], "description": "Data privacy has become a challenging issue to both keep personal data private and benefit from the data analytics using modern machine learning (ML) techniques at the same time. This poster presents a privacy preserving ML application by moving data analytics from cloud to edge device. The following work represents useful approach in fight against COVID-19 while maintaining people privacy.", "name": "A Privacy-Preserving Machine Learning Approach in the Age of Pandemics", "type": "Session"}, "79": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Artificial Intelligence"], "speakerIds": [48], "description": "In this work, we provide an empirical analysis of using phonemes vs graphemes in the neural text to speech systems for English and Spanish and detailed implementation of a grapheme-to-phoneme (g2p) module for both the languages. We demonstrate that the g2p system combined with a phoneme-based neural TTS system outperforms the grapheme-based system in naturalness and has fewer pronunciation errors.", "name": "An Empirical Analysis of Graphemes versus Phonemes in End-to-End Neural Text to Speech", "type": "Session"}, "80": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [419], "description": "One of the reasons why neural networks can cause unfairness in a decision-making system is that they can add biases (e.g. racial and gender biases) to the model. By using a more disentangled representation, one can ensure that this does not happen. In this work, we increase disentanglement in variational autoencoders (VAEs) by proposing a novel generative model based on capsule neural networks.", "name": "Capsule Networks for Enhanced Representation Learning with VAEs", "type": "Session"}, "81": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Human Computer Interaction"], "speakerIds": [491], "description": "In the study of complex systems, scientists seek to understand the influence of stimulation parameters. So, they run many simulations with varying initial conditions in what is known as an ìensembleî. As data moves to exabyte scales, analyzing and storing raw data is challenging. In this work, we present a visual analysis approach for analyzing an ensemble that solely relies on image-based data.", "name": "Visual Analysis of Image-Based Simulation Ensembles", "type": "Session"}, "82": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Human Computer Interaction"], "speakerIds": [194], "description": "Adolescents increasingly leverage the internet to seek intimacy and to find support concerning sexual health and experiences. We analyze social media trace data from a peer support platform and examine what online sexual experiences with people they know adolescents seek support for, and what kind of peer support they receive to deal with their experiences.", "name": "Online Peer Support for Adolescent Online Sexual Risk", "type": "Session"}, "83": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Natural Language Processing"], "speakerIds": [2], "description": "Viral hashtags emerge on Twitter to discuss political topics, and in response, others are created to express divergent stances. We evaluate the potential for classification between hashtag pairs by characterizing discourse using textual analysis, embeddings, entropy, and divergence. Analyses reveal unity in topic, diction, and syntax but observed contrasts in sentiment and psychological processes.", "name": "Discourse Analysis of Pairwise Twitter Hashtags", "type": "Session"}, "84": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Human Computer Interaction"], "speakerIds": [377], "description": "Intelligent tutoring systems (ITS) were developed to provide personalized learning for students who were struggling in courses. However, current ITS technology doesnít utilize the important information on human-computer interaction between students and the system. Our research aims to capture this interaction and understand how and when students learn, which will improve ITSs and online learning.", "name": "Improving Online Intelligent Tutoring Systems by Identifying Cognitive Processes with fNIRS", "type": "Session"}, "85": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Artificial Intelligence"], "speakerIds": [56], "description": "Due to the worldwide spread of COVID-19, people are practicing social distancing. Quarantine is necessary but not as fun as it sounded. Staying home has made it essential to indulge in some kind of activity to get rid of boredom.One thing I observed most is the need for exercise as people are not leaving homes. I developed a prototype to monitor a userís exercise routine using pose recognition.", "name": "Exercise Monitor During Quarantine", "type": "Session"}, "86": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Computer Systems Engineering"], "speakerIds": [487], "description": "For someone new to cloud storage, getting started can be much like walking in a fog. We know we need an easy, affordable way to move our data there but each time we think we have found a solution, we run into hidden obstacles that keep us from moving forward. We will look at how open source Linux packages can be used to clear a path through the fog and do so at a price that we can afford.", "name": "Combatting the Cost and Complexity of the Cloud", "type": "Session"}, "87": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [298], "description": "Relational reasoning over Knowledge Graphs (KG) has become popular due to a variety of applications such as question answering and information retrieval, which are critical for providing easy access to accurate information in times of crisis, such as the COVID pandemic. In this work, I address this problem by taking a reinforcement learning approach for efficient path-based reasoning over KGs.", "name": "Deep Reinforcement Learning for Heterogeneous Relational Reasoning in Knowledge Graphs", "type": "Session"}, "88": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Emerging Technology"], "speakerIds": [447], "description": "Regarding computers, in 1983 Grace Hopper said, ìWeíre only at the beginning...Weíve got the Model T.î Like the Model T Ford glimpsed the future of cars, in the COVID-19 world of today, cashierless stores foreshadow the autonomous systems of tomorrow. This case study unpacks how synthetic data (trillions of auto-generated avatars) can inclusively train AI to recognize shopping behaviors with ML.", "name": "AI-Powered Autonomous Stores: Training AI for Inclusion Using Synthetic Data", "type": "Session"}, "89": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Emerging Technology"], "speakerIds": [162], "description": "The combination of speed and reach of 5G wireless technology will unlock hot technology trends. 5G will enable internet of everything, robotics, AR/VR, high definition video communication & haptic feedback which will revolutionize patient care experience by supporting real-time, immersive advanced tele-health services, delivering a more secure, sustainable and effective healthcare system for alI.", "name": "What is 5G and how will it impact our lives and revolutionize healthcare", "type": "Session"}, "90": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Computer Systems Engineering"], "speakerIds": [159, 438], "description": "Wi-Fi6 is the latest offering of 802.11 aimed at providing increased network capacity. Typical dense networks deployments would be Large Public Venues which can reap benefit of multi-user transmissions and are at high risk for attacks. In this paper, we identified a hole in the Wi-Fi6 standard which can be exploited. We propose a strategy to detect and effectively mitigate this DOS attack.", "name": "Protect Wi-Fi6 Network from Denial of Service(DOS) Attack", "type": "Session"}, "91": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Algorithms and Data Structures"], "speakerIds": [179], "description": "Machine knitted textiles are increasingly important in many industries. Computational modeling, simulation, and design of such structures require e&#64259;cient representations. To that end we propose a process-oriented representation, TopoKnit, that de&#64257;nes a foundational data structure for representing the topology of weft-knitted textiles at the yarn scale.", "name": "A Process-Oriented Representation for Modeling the Topology of Weft-Knitted Textiles", "type": "Session"}, "92": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Human Computer Interaction"], "speakerIds": [224, 333], "description": "With a compound growth rate of 29.7% from 2019 to 2024 the global market size for chatbots is projected to grow to $9.4 billion. Everyone wants to jump on the chatbot bandwagon. To get human/machine interaction right, a lot of thought and care needs to be placed in the design of the conversational flow and interaction. Our graphical representation of the design process is here to help.", "name": "May the Bots Be With You: Enabling Smarter Conversation Design", "type": "Session"}, "93": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Emerging Technology"], "speakerIds": [320], "description": "Experts estimate there will be 31 billion IoT devices installed in 2020 and more than 75 billion by 2025. With the drastic differences in types of iot devices, and the companies that are bringing them online and in what conditions, how do you simplify and create a solution at scale. From car manufacturers, to home thermostats learn how AWS is leading the charge in bringing iot devices online.", "name": "Bringing IOT Devices Online, in the Field, at Home and in the Factory", "type": "Session"}, "94": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Cloud Computing"], "speakerIds": [371], "description": "Organizations tend to use multiple cloud providers when migrating their applications to the cloud. However, it is challenging to come up with an optimal multi-cloud solution. In this poster, we present a novel methodology for preparing such solution, where we use text mining, cloud feasibility and optimization on application data. We illustrate our approach with an example use case from COVID-19.", "name": "Multi-cloud Solution Design for Migrating a Portfolio of Applications to the Cloud", "type": "Session"}, "95": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Computer Science Education, Broadening participation in computer science"], "speakerIds": [284], "description": "Many students dismiss computer science as impenetrable, exclusive, or irrelevant to daily life. Our escape room circumvents this by being subtly technical: students unknowingly solve logic problems addressed by common algorithms. When the connection is revealed, they learn not to underestimate their ability, to approach algorithms critically, and that computer science is not so daunting after all!", "name": "Untapped Potential: A Subtly Technical Escape Room Aims to Create an Overtly Diverse Workforce", "type": "Session"}, "96": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Data Science"], "speakerIds": [32], "description": "As the global pandemic progresses, human-sentiment and behavior are shifting drastically. Due to information overload and intensified digital activity, a deeper level of personalization is needed through a recommendation engine that uses session-based sequential sampling and comparison-based ranking to provide consumers with better and lesser alternatives to choose from reducing decision fatigue.", "name": "Personalised Recommendation to reduce Decision Fatigue due to High Digital Activity during Pandemic", "type": "Session"}, "97": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [462], "description": "When a crisis occurs, social media platforms can be considered as the source of getting timely  information. To identify useful information, we develop Deep Neural Networks to do binary classification task. To  solve  the  issue of labeling dataset,  we combine our models with active  learning.  We  can  apply  our  model  on  the   GeoCov19 containing more than 524 million multilingual tweets.", "name": "Deep Active Learning Towards Tweets Classification during Crisis Situations such as COVID-19", "type": "Session"}, "98": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Product Test Development"], "speakerIds": [394], "description": "Safety is one of the biggest challenges for automated vehicles (AV). Industry players have been pushing their AV safety vision with frameworks in the form of safety laws. In this work we present a method to explore the performance limits of AV safety models.Our method automatically extracts safety profiles providing parametric boundariesfor safe implementation.", "name": "Verifying Safety Laws for Automated Vehicles", "type": "Session"}, "99": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Environmental Engineering and Environmental Information Technology, including Renewable Energy and Green Technology"], "speakerIds": [153], "description": "The benefits of sorting trash seem straightforward. However, not so many people do it. Currently, waste classification is inconvenient and time-consuming. The confusion with waste categories plays a role in demotivating people to sort their trash. To tackle this problem, we aim to develop a more effective system using deep learning technology that helps sort the trash faster and more accurately.", "name": "Deep Learning towards a More Effective Waste Classification System", "type": "Session"}, "100": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Data Science"], "speakerIds": [254], "description": "We mine Reddit forums pertaining to gender-related social movements, namely r/Feminism, r/MensRights, and r/TheRedPill. We use methods adapted from text mining, such as topic modelling and overlap analysis of users posting on these forums.  Our work helps us understand the people involved in these movements, the issues they discuss, and the different perspectives they have on these issues.", "name": "Text Mining to Understand Stories from r/TheRedPill , r/MensRights , and r/Feminism", "type": "Session"}, "101": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Databases/Information Retrieval/Data Mining"], "speakerIds": [334], "description": "This paper presents a website tag propagation system to tackle fake news related to Covid19. Tags are propagated from the CDC website to other relevant webpages in the webgraph by performing a Markov Chain Simulation, and using link analysis through the random surfer model and document similarity metrics. This validates the information on the tagged websites and eliminates fake websites.", "name": "Website Tag Propagation with Covid19 Use Case", "type": "Session"}, "102": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Security"], "speakerIds": [352], "description": "This project aims to expand upon previous work in improving the accuracy of website fingerprinting attacks in overlapped website visits. Website fingerprinting attacks are a type of network traffic attack done by a passive observer that aims to decrypt usersí web activity by analyzing their packet sequence. This study will analyze the effectiveness of a sectioning algorithm on real-world datasets.", "name": "Importance of Datasets in Website Fingerprinting", "type": "Session"}, "103": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [403], "description": "Intelligent Document Processing(IDP) transforms the way documents are processed by automatically extracting its contents and sending to downstream systems thereby building a robust pipeline without any manual entry.In COVID-19, when printers are not handy,it is helping in faster processing of the documents received via email and is also teaching new hires about incorrect data without team support.", "name": "Intelligent Document Processing", "type": "Session"}, "104": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Artificial Intelligence"], "speakerIds": [154], "description": "Computer-assisted surgery has evolved with the advancing technology to augment a surgeonís ability to administer surgical procedures. It assists in decreasing the invasiveness of surgical procedures and improving safety and accuracy. This talk will provide an overview of the work in computer vision and surgical robotics that the author and her colleagues have done in CAS at the BioRobotics Lab.", "name": "Robotics and Computer Vision in the Operating Room", "type": "Session"}, "105": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Human Computer Interaction"], "speakerIds": [216], "description": "Speech is a powerful tool for human communication. Vocally impaired individuals are now able to communicate real time via this wearable wireless assertive device utilizing TongueToSpeech (TTS). The device incorporates a capacitive touch keyboard interface embedded inside a discrete retainer, connects to a smartphone, and offers the user keyboard usage, in addition to helpful apps.", "name": "Tongue Ventures: A Discrete Oral Wearable", "type": "Session"}, "106": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Machine Learning"], "speakerIds": [369], "description": "Few-shot learning   is   a   type   of machine  learning  designed  to  enable  the  model  to  generalize to  new  classes  with  very  few  examples. In this research, we address two audio classification tasks with  the  Prototypical  Network  few-shot learning  algorithm,  and  assess  performance  of  various  encoder architectures across multiple datasets.", "name": "A Study of Few-Shot Audio Classification", "type": "Session"}, "107": {"date": {"start_date": "09/29/20", "end_date": "10/03/20", "start_PT": "09:40 AM", "end_PT": "01:00 PM", "start_ET": "12:40 PM", "end_ET": "04:00 PM"}, "categories": ["Human Computer Interaction"], "speakerIds": [181], "description": "Job interviews are challenging for individuals with Autism Spectrum Disorder. Existing digital training tools are limited in their ability to simulate a realistic interview, collect data, and provide feedback for improvement. We designed InterViewR, a simulation-based interview training system that combines virtual reality and wearable smart technology to provide realistic interview experience.", "name": "InterViewR: A Mixed-Reality based Interview Training Platform for Individuals with Autism", "type": "Session"}, "108": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "11:00 AM", "end_PT": "11:30 AM", "start_ET": "02:00 PM", "end_ET": "02:30 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Keynote", "type": "Session"}, "109": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "11:35 AM", "end_PT": "12:35 PM", "start_ET": "02:35 PM", "end_ET": "03:35 PM"}, "categories": ["Data Science", "Beginner"], "speakerIds": [182, 366, 464], "description": "Charts can feel like a pair of shoes. You always have your go-to favs! But are they the best fit for your data goals? Learn the secrets of turning big data to accurate, compelling visuals that go beyond basic charts. Join us as we step through our creative design process and unravel COVID-19 data to reveal its effect on our communities. Design an intriguing and impactful visual to tell your story!", "name": "Beyond Imagination:  The Secret to Designing Beautiful, Creative Custom Visuals", "type": "Session"}, "110": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "11:35 AM", "end_PT": "12:35 PM", "start_ET": "02:35 PM", "end_ET": "03:35 PM"}, "categories": ["Entrepreneurship", "All"], "speakerIds": [275, 263, 85, 237, 289], "description": "It is often assumed that women in CS understand and appreciate diversity and advocate for all. However, there exist highly publicized examples of women failing to account for the intersection of race and gender and the differing experiences of women with intersecting identities. This panel convenes diverse women in CS to discuss the importance of same-gender allyship, advocacy, and activism.", "name": "Seeing Beyond Yourself: Effective Allyship, Advocacy, and Activism for Women in Computing", "type": "Session"}, "111": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "11:35 AM", "end_PT": "12:05 PM", "start_ET": "02:35 PM", "end_ET": "03:05 PM"}, "categories": ["Software Engineering", "Beginner"], "speakerIds": [478], "description": "Many organizations want high performing teams yet have vague ideas as to what that actually means. Learn some defining characteristics of high performing teams: caring, collaborating, communicating, and taking ownership.  Walk away with actionable hacks such as \"Did you ask?\" and \"Because Science!\" that can be used in any team and with any framework to maximize team effectiveness.", "name": "Hack Your Way to a Higher Performing Team", "type": "Session"}, "112": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "11:35 AM", "end_PT": "12:05 PM", "start_ET": "02:35 PM", "end_ET": "03:05 PM"}, "categories": ["Entrepreneurship", "Intermediate"], "speakerIds": [328], "description": "Only three women have founded public infrastructure companies worth $1B+. One being Michelle Zatlyn, who co-founded Cloudflare during the last US economic downturn and transformed it into a leading Internet company. She'll share her perspective and lessons learned in creating a diverse workforce and navigating times of crisis while building a thriving companyóso you can build yours faster.", "name": "Lessons Learned in Founding A Meaningful, Thriving Business - So You Can Build Yours Faster", "type": "Session"}, "113": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "11:35 AM", "end_PT": "12:05 PM", "start_ET": "02:35 PM", "end_ET": "03:05 PM"}, "categories": ["Career", "All/Senior Career"], "speakerIds": [176], "description": "Covid-19's impact is unprecedented. This talk will shed light on the unique challenges retail technology faces and the rapidly changing business priorities under these circumstances. These challenges required teams to find new ways to lead remotely and increase their agility while still contributing to critical business outcomes.", "name": "Leading Remotely in Retail Technology in the Face of Unprecedented Adversity", "type": "Session"}, "114": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "11:35 AM", "end_PT": "12:35 PM", "start_ET": "02:35 PM", "end_ET": "03:35 PM"}, "categories": ["Tech for Women", "Beginner"], "speakerIds": [276, 260, 207, 221, 75], "description": "Many recent advances in the field of quantum computing have captured popular interest in the field. Quantum systems are also now more accessible than ever with devices hosted on the cloud and numerous quantum software packages under development. So how can you get involved in quantum computing now? What are the current hot topics and what are the roadblocks? Quantum experts will discuss!", "name": "What You Need to Know About Quantum Computing for Scientists, Engineers, and Developers", "type": "Session"}, "115": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "11:35 AM", "end_PT": "12:05 PM", "start_ET": "02:35 PM", "end_ET": "03:05 PM"}, "categories": ["Computer Systems Engineering", "Intermediate"], "speakerIds": [196, 14], "description": "Enormous compute power is required to solve many problems with AI. Today’s compute capacity is throttling the advancement of AI and is unsustainable without pushing the limits for new AI compute. We will share the design and implementation of an AI supercomputer that will power AI research into a new level of complex problem solving, enabling a journey towards 1000x improvements in AI compute.", "name": "Building an AI Supercomputer: How We Did it!", "type": "Session"}, "116": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "12:05 PM", "end_PT": "12:35 PM", "start_ET": "03:05 PM", "end_ET": "03:35 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Systers Networking", "type": "Session"}, "117": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "12:05 PM", "end_PT": "12:35 PM", "start_ET": "03:05 PM", "end_ET": "03:35 PM"}, "categories": ["Entrepreneurship", "Beginner"], "speakerIds": [416], "description": "Curious about starting a company but haven't settled on an idea yet? Holly Liu, Co-Founder of Kabam, will walk you through a framework for thinking about and evaluating startup ideas. Holly will talk about her experience as a founder and her perspective on when it is time to turn an idea into a company.", "name": "How to Evaluate Startup Ideas?", "type": "Session"}, "118": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "12:05 PM", "end_PT": "12:35 PM", "start_ET": "03:05 PM", "end_ET": "03:35 PM"}, "categories": ["All"], "speakerIds": [], "description": "Learn more about AnitaB.org Membership and get first-hand experience to a Premium benefit with access to a Career Conversation hosted by Jordan Sale, founder of 81 cents. Make sure you're being paid market rates by learning about opportunities to access personalized market data, compensation feedback, and career advice from hiring managers and recruiters in their field.", "name": "Membership Session", "type": "Session"}, "119": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "12:05 PM", "end_PT": "12:35 PM", "start_ET": "03:05 PM", "end_ET": "03:35 PM"}, "categories": ["Software Engineering", "Beginner"], "speakerIds": [303], "description": "Performing high quality code reviews can transform your development team by improving your productivity, knowledge, and code maintainability! I will share tips to embrace reviews as learning opportunities through tooling and best practices around submitting code for review and being a reviewer. You’ll also learn to give and receive feedback to foster an inclusive and collaborative review culture.", "name": "Transform your Code Reviews for Inclusive and Productive Collaboration", "type": "Session"}, "120": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "12:05 PM", "end_PT": "12:35 PM", "start_ET": "03:05 PM", "end_ET": "03:35 PM"}, "categories": ["Career", "All/Senior Career"], "speakerIds": [278], "description": "In today's world, companies are under constant threat of attack from cyber criminals both domestic and foreign. Having a high performing and diverse cybersecurity team is crucial to protecting a company and its customers. Heather will walk through how her journey as a single mother, military service member, and commercial sector senior leader provides numerous lessons for women in cybersecurity.", "name": "Lessons Learned from Protecting a Nation to Protecting a Fortune 100 Company", "type": "Session"}, "121": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "12:05 PM", "end_PT": "12:35 PM", "start_ET": "03:05 PM", "end_ET": "03:35 PM"}, "categories": ["Hardware", "Beginner"], "speakerIds": [455, 16], "description": "Behind every smart device, is a smart System-on-Chip (SoC). Manufacturing an SoC can be very costly, particularly for custom made SoCs. The goal of any SoCmanufacturer is to find all bugs before the SoC is built. Formal Verification and Simulation are two primary methods to debug and validate the functionality of anSoC Pre-Silicon, as explained in this paper with the aid of simple examples.", "name": "Breaking the Chip: Techniques to Validate Hardware", "type": "Session"}, "122": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "12:40 PM", "end_PT": "01:10 PM", "start_ET": "03:40 PM", "end_ET": "04:10 PM"}, "categories": ["Software Engineering", "Intermediate"], "speakerIds": [169, 322], "description": "Many engineers are not connected to their customers, but by combining design thinking with Agile, they can build solutions that delight. In this session, attendees will see how a design thinking model called Design for Delight is applied within Agile frameworks, with tools that can be adapted for remote work due to COVID-19, to deliver thoughtful and inclusive solutions that can change the world.", "name": "An Engineer's Essential Tool in Agile is Design Thinking", "type": "Session"}, "123": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "12:40 PM", "end_PT": "01:40 PM", "start_ET": "03:40 PM", "end_ET": "04:40 PM"}, "categories": ["All"], "speakerIds": [], "description": "Like pro-bono law service or Doctor Without Borders, civic leave is a process where private-sector tech employees may take a short-term leave of absence to work in local, state, or federal government. During this panel discussion, you’ll hear from technologists who have completed civic leave and learn how to advocate for more civic leave pathways at your tech company.", "name": "A Pivotal Moment: Why Civic Leave May Be Right for Your Career", "type": "Session"}, "124": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "12:40 PM", "end_PT": "01:10 PM", "start_ET": "03:40 PM", "end_ET": "04:10 PM"}, "categories": ["Data Science", "Intermediate"], "speakerIds": [234, 96], "description": "Randomized A/B tests are ideal, but often impossible to run due to ethical considerations, costs, or competing priorities. We suggest two observational approaches to try instead: difference-in-differences and synthetic control. We outline the theory, discuss implementation concerns, and close with rules of thumb to help attendees choose the appropriate causal method.", "name": "Beyond A/B Tests: Two Causal Models, Applied to a Hypothetical COVID-19 Intervention", "type": "Session"}, "125": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "12:40 PM", "end_PT": "01:40 PM", "start_ET": "03:40 PM", "end_ET": "04:40 PM"}, "categories": ["Emerging Technology", "Beginner"], "speakerIds": [214, 170, 448], "description": "Quantum computers will potentially solve a whole class of problems that are too difficult for even the most powerful computers that exist today.  Attendees of this workshop will learn how to program a quantum computer using our python based software development kit, Qiskit.  (see https://qiskit.org/ for installation)", "name": "How to Program a Quantum Computer", "type": "Session"}, "126": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "12:40 PM", "end_PT": "01:10 PM", "start_ET": "03:40 PM", "end_ET": "04:10 PM"}, "categories": ["Diversity, Equity and Inclusion", "All"], "speakerIds": [10], "description": "According to the CDC, six in 10 adults in the US have chronic illness. With such a staggering ratio, you can expect to meet folks who have chronic illness daily as co-workers, friends, or employees (or even yourself). We will discuss how folks dealing with chronic illness can still lead a normal work life, and how you as a co-worker, boss, or fellow human being can help make their lives easier.", "name": "Adapting: Work in Tech with Chronic Illness", "type": "Session"}, "127": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "12:40 PM", "end_PT": "01:40 PM", "start_ET": "03:40 PM", "end_ET": "04:40 PM"}, "categories": ["Software Engineering", "All"], "speakerIds": [472, 166, 21, 337, 339], "description": "Individuals with disabilities often feel they do not ëfit intoí the tech scene. They have questions about if, when, and how they should disclose information about their disability in the context of education and employment. Panelists will describe their experiences disclosing disability, offer advice to others who are navigating these conversations and share tips on disability advocacy.", "name": "Navigating the Tech Scene with a Disability", "type": "Session"}, "128": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "12:40 PM", "end_PT": "01:40 PM", "start_ET": "03:40 PM", "end_ET": "04:40 PM"}, "categories": ["Diversity, Equity and Inclusion", "Beginner"], "speakerIds": [19, 121, 131, 453, 144], "description": "With the rise of IoT devices, it is clear that machine learning will need to be pushed to the edge in custom hardware. Neuromorphic computing (NC) is one path forward, but there are many open questions about how it will be implemented and deployed. In this panel, experts in NC from academia, industry, and government will debate the future of NC and brain-inspired hardware for the edge.", "name": "Brain-Inspired Computing for the Edge", "type": "Session"}, "129": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "12:40 PM", "end_PT": "01:10 PM", "start_ET": "03:40 PM", "end_ET": "04:10 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "GHC Scholars Networking", "type": "Session"}, "130": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "01:10 PM", "end_PT": "01:40 PM", "start_ET": "04:10 PM", "end_ET": "04:40 PM"}, "categories": ["Tech for Women", "Intermediate"], "speakerIds": [293, 468], "description": "Given the increasing disparities, racial profiling, and protests today, many parents want to raise kids who care about fairness and equity in communities. What can we do to ensure our Gen Z (and Gen Alpha) make a positive impact? Come listen to this mother-daughter duo's successful philanthropic journey, from a $100 gift to over $100,000 in giving, and learn proven techniques to guide your youth.", "name": "The Magic of Empowering Your \"Gen Z\" Daughter with a $100 Gift to Make a Difference", "type": "Session"}, "131": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "01:10 PM", "end_PT": "01:40 PM", "start_ET": "04:10 PM", "end_ET": "04:40 PM"}, "categories": ["Data Science", "Intermediate"], "speakerIds": [314, 209], "description": "When customers file tax returns using products like TurboTax, they often seek help from tax experts. We developed a novel metric-driven ML method that recommends the best channel: chat, callback or scheduling. With training data that now includes COVID-19 stimulus check inquiries, we can enhance the user experience of customers who are financially impacted and improve our operational efficiency.", "name": "Chi-chat: A Metric-Driven User Cohorting Framework for Best Channel Recommendation", "type": "Session"}, "132": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "01:10 PM", "end_PT": "01:40 PM", "start_ET": "04:10 PM", "end_ET": "04:40 PM"}, "categories": ["Software Engineering", "Intermediate"], "speakerIds": [261], "description": "Meredith Johnson helped lead process and culture transformations that evolved Blackbaud's tech strategy from an on-prem leader at risk of stagnation to an agile development model. Recently, she led teams to roll out features needed by social good organizations to operate during COVID-19 in just days. Learn how to inspire teams to continually innovate and why culture is harder than product updates.", "name": "Be Brave: Lessons from a Total Technology & Culture Transformation", "type": "Session"}, "133": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "01:10 PM", "end_PT": "01:40 PM", "start_ET": "04:10 PM", "end_ET": "04:40 PM"}, "categories": ["All"], "speakerIds": [], "description": "The BRAID initiative is an NSF-funded research project that supports computer science departments with efforts to increase the percentage of women and URM students in their undergraduate computing programs. This reception will provide a networking opportunity for students and faculty from the 15 BRAID institutions and the project’s corporate funders (Intel, Microsoft, and Qualcomm).", "name": "BRAID Welcome Reception", "type": "Session"}, "134": {"date": {"start_date": "09/29/20", "end_date": "09/29/20", "start_PT": "01:45 PM", "end_PT": "02:15 PM", "start_ET": "04:45 PM", "end_ET": "05:15 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Keynote", "type": "Session"}, "135": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "01:00 AM", "end_PT": "01:30 AM", "start_ET": "04:00 AM", "end_ET": "04:30 AM"}, "categories": ["All"], "speakerIds": [], "description": "Join Dr. Lisa Su, President and CEO of AMD and this year's Technical Leadership Abie Award Winner, as she shares insights from her experience as a reknowned technology and business leader in the semiconductor industry.", "name": "Abie Award Series: 2020 Technical Leadership Award Winner", "type": "Session"}, "136": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "07:00 AM", "end_PT": "08:00 AM", "start_ET": "10:00 AM", "end_ET": "11:00 AM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Liquid Metal Yoga", "type": "Session"}, "137": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "09:00 AM", "end_PT": "09:30 AM", "start_ET": "12:00 PM", "end_ET": "12:30 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Keynote", "type": "Session"}, "138": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "09:40 AM", "end_PT": "10:40 AM", "start_ET": "12:40 PM", "end_ET": "01:40 PM"}, "categories": ["Data Science", "Beginner"], "speakerIds": [282, 233, 311], "description": "Want to learn about predictive modeling? Watch as we compete to solve a real-world problem in the guise of a cooking competition. Instead of cooking up pastries, our chefs will be whipping up models and peppering in current events. You'll learn modeling concepts including data scrubbing, the basic steps to build a model, and measuring the effectiveness of a model. Come play along with our teams!", "name": "The Predictive Modeling Cooking Show", "type": "Session"}, "139": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "09:40 AM", "end_PT": "12:20 PM", "start_ET": "12:40 PM", "end_ET": "03:20 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "PitcHER Competition", "type": "Session"}, "140": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "09:40 AM", "end_PT": "10:10 AM", "start_ET": "12:40 PM", "end_ET": "01:10 PM"}, "categories": ["Senior Career"], "speakerIds": [], "description": "", "name": "Senior Leadership Summit Featured Session", "type": "Session"}, "141": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "09:40 AM", "end_PT": "10:10 AM", "start_ET": "12:40 PM", "end_ET": "01:10 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Featured Session", "type": "Session"}, "142": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "09:40 AM", "end_PT": "10:10 AM", "start_ET": "12:40 PM", "end_ET": "01:10 PM"}, "categories": ["Artificial Intelligence", "#N/A"], "speakerIds": [157], "description": "Natural language is constantly evolving. Roughly, 50% of the world speaks two or more languages. This comes as a challenge to Natural Language (NL) systems because conventional models are trained to understand large monolingual corpus. In this talk, we'll focus on building inclusive multilingual models, especially novel approaches to understand underrepresented languages and transliterated text.", "name": "\"Bonjour! Wie geht es dir? Dhanyawaad\" - How Multilingual Is Your NLP Model?", "type": "Session"}, "143": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "09:40 AM", "end_PT": "10:40 AM", "start_ET": "12:40 PM", "end_ET": "01:40 PM"}, "categories": ["Product Management", "Beginner"], "speakerIds": [244, 64], "description": "Broaden your career impact by learning product management skills to supplement your engineering background. Join us in this collaborative, virtual workshop to understand the product management role and stages involved with growing a product from idea to fruition. Leave the workshop with new skills, innovative ideas, and an understanding of working in a cross-functional, inclusive environment!", "name": "Develop Your Product Management Toolkit in 60 Minutes", "type": "Session"}, "144": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "09:40 AM", "end_PT": "10:10 AM", "start_ET": "12:40 PM", "end_ET": "01:10 PM"}, "categories": ["Software Engineering", "Intermediate"], "speakerIds": [52], "description": "When thinking about what excites engineers, working on legacy stacks rarely comes to mind. Most of us want to work on the newest technologies. Why can't we do both? Come learn about how to effectively re-engineer your technology stack. Not only will you get to work on frameworks you enjoy and help retain engineers, you'll also help reduce cost and risk associated with using older technologies.", "name": "Re-engineering Inside the Lines: How to Innovate Within a Legacy Stack", "type": "Session"}, "145": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Software Engineering", "Beginner"], "speakerIds": [187, 97], "description": "Covid19 clearly brought forward importance of hosting and managing applications in Cloud. As enterprises move towards Cloud, technologies like Containers & Kubernetes are at the forefront. Open-source project Operator supported by worldwide developer community allows for packaging, deploying and managing Kubernetes apps. Join us to explore how Operators can simplify the life of DevSecOps in Cloud.", "name": "How Kubernetes Operators can Rescue DevSecOps in midst of a Pandemic?", "type": "Session"}, "146": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Career", "All"], "speakerIds": [33], "description": "In the light of the 2020 events, being able to speak up and articulate our opinions has become a critical skill. Difficult conversations make it harder to push our message whether it is to communicate on a sensitive topic, ask for a raise or break some tough news. Join us to learn a pragmatic method to prepare difficult conversations in order to maximize our impact and success.", "name": "BRAVE: a Method for Successful Difficult Conversations", "type": "Session"}, "147": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Senior Career"], "speakerIds": [], "description": "Now, more than ever, leaders are faced with making quick decisions that will deliver results and drive change to meet business demands. Leaders have had to quickly pivot to meet the demands of work in a virtual environment while considering the long-lasting impacts for the business and engaging teams to work effectively and efficiently. Join us for the Senior leadership Summit at Virtual GHC where we will explore effective leadership in a virtual world.", "name": "Senior Leadership Summit Presentation", "type": "Session"}, "148": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["All"], "speakerIds": [], "description": "Join the 2020 Technology Entrepreneurship Abie Award Winner, Tracy Young, as she shares the candid and raw account of a startup Founder and CEO's journey. Tracy Young will talk about how she learned to embrace her female identity, and share her experience leading a high growth startup while also going through infertility, pregnancy, birth, and miscarriage.", "name": "Abie Award Series: A Real Conversation About What it Means to be a Female CEO", "type": "Session"}, "149": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Artificial Intelligence", "Beginner"], "speakerIds": [241], "description": "Users of smartphones and smart home systems expect their devices to be aware of their situation, and to interact with them naturally. This presentation identifies three aspects of human communication: style, content and transfer; and how they can be controlled to make machines sound more like humans. This talk further explores the broader ethical impact of controllable text generation.", "name": "Text Generation: Should Machines Reflect the Way Humans Interact in Society?", "type": "Session"}, "150": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Virtual, Augmented, and Mixed Reality", "Beginner"], "speakerIds": [466, 125], "description": "Exploring a new city on foot can be hard, but what if directions and information about whatís around you could be overlaid on the real world? Google Maps developed Live View, its first AR capability, to help people do just that. After 150+ prototypes and finally bringing AR to life in Google Maps, we wanted to share our learnings for developing and designing in an ambiguous and nascent space.", "name": "Developing Live View for Google Maps: A Lesson in Working With Emerging Technologies", "type": "Session"}, "151": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Tech for Women", "Beginner"], "speakerIds": [499], "description": "Who tells your story matters. For too long, knowledge has been written by those in power. Open platforms like Wikipedia change the traditional paradigm of how knowledge is written. In this talk, youíll learn about how technology can help us create a history that is more diverse, more representative, and ultimately more accurate - and how you can get involved.", "name": "Who Tells Your Story - How Technology Can Help Amplify Underrepresented Voices", "type": "Session"}, "152": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "10:45 AM", "end_PT": "11:15 AM", "start_ET": "01:45 PM", "end_ET": "02:15 PM"}, "categories": ["Product Management", "Beginner"], "speakerIds": [77], "description": "Some of the most commonly asked user interview questions turn out to be really hard for people to answer (and it's not their fault, our brains are wired to take shortcuts and rationalize our behavior). In this session youíll learn how to overcome these limitations and ask the right questions to help identify true, unbiased, user needs that set you up for product success.", "name": "You're Asking Users the Wrong Questions!", "type": "Session"}, "153": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "10:45 AM", "end_PT": "11:15 AM", "start_ET": "01:45 PM", "end_ET": "02:15 PM"}, "categories": ["Data Science", "Beginner"], "speakerIds": [80], "description": "The techniques used to recommend the next book or movie can also help suggest which tests to run for a given change. Salesforce has more than a million tests making it infeasible to run all tests on every change. Join me to hear how we built Test Prioritizer that uses multiple features like historical test results data and code coverage to train a model that can recommend relevant tests per change", "name": "Test Recommendation using Machine Learning", "type": "Session"}, "154": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "10:45 AM", "end_PT": "11:15 AM", "start_ET": "01:45 PM", "end_ET": "02:15 PM"}, "categories": ["Senior Career"], "speakerIds": [], "description": "Now, more than ever, leaders are faced with making quick decisions that will deliver results and drive change to meet business demands. Leaders have had to quickly pivot to meet the demands of work in a virtual environment while considering the long-lasting impacts for the business and engaging teams to work effectively and efficiently. Join us for the Senior leadership Summit at Virtual GHC where we will explore effective leadership in a virtual world.", "name": "Senior Leadership Summit", "type": "Session"}, "155": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "10:45 AM", "end_PT": "11:15 AM", "start_ET": "01:45 PM", "end_ET": "02:15 PM"}, "categories": ["Career", "All"], "speakerIds": [222], "description": "The public and private life of a leader presents daily encounters, stressors, and triggers that impact emotional and mental health.  These triggers and stressors are magnified implicitly and explicitly for founders and senior executives.  This interactive session melds theory and practice by introducing attendees to [2] simple but powerful emotional and mental health practices to use daily.", "name": "The Tough Stuff We Carry: Mental and Emotional Health Strategies for Executives", "type": "Session"}, "156": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": ["Emerging Technology", "Intermediate"], "speakerIds": [188, 206, 8], "description": "COVID-19 pandemic has accelerated automated driving efforts in the world. It enables contactless travel, delivery of groceries & medical supplies to restricted zones. Understand the steps involved in HD map-making and see them come alive in 3D. Walk away with visualization of LiDAR point-clouds, map-features extracted from LiDAR imagery and the final HD-map, using a 3D web-map rendering (harp.gl)", "name": "Sensor Data to HD Maps for Driverless Cars: Visualize the Transformation", "type": "Session"}, "157": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": ["Artificial Intelligence", "Intermediate"], "speakerIds": [305, 280], "description": "ML algorithms influence areas such as recruiting and criminal justice. Building transparent models is key to ensuring that outcomes are equitable and fair. However, it is hard to implement in practice. Interpret-text is an easy-to-use OSS package with SOTA explainers for BERT and RNN and an interactive visualization dashboard. Come learn to build and explain NLP models for sentiment analysis.", "name": "Towards Transparent AI:  Understanding Text-Based Model Predictions", "type": "Session"}, "158": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "10:45 AM", "end_PT": "11:15 AM", "start_ET": "01:45 PM", "end_ET": "02:15 PM"}, "categories": ["All"], "speakerIds": [], "description": "Join Pelagia Majoni, 2020 Student of Vision Abie Award winner, as she speaks about her work in empowering marginalized communities in the US and in Zimbabwe. Pelagia will also discuss how she has handled the obstacles on her journey towards a world in which technology is inclusive of all.", "name": "Abie Award Series: Student of Vision Pelagia Majoni On Making Tech Inclusive for African Students", "type": "Session"}, "159": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "10:45 AM", "end_PT": "11:15 AM", "start_ET": "01:45 PM", "end_ET": "02:15 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Featured Session", "type": "Session"}, "160": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": ["Career", "Intermediate"], "speakerIds": [231, 378, 111, 156], "description": "Today's cloud system is challenged beyond Moore's Law. In the post COVID world, data volume has increased exponentially that we need a holistic approach to manage infrastructure capacity. Ironically, Machine Learning (ML) is both the cause and the solution. This panel explores how we use ML to tackle elastic compute problems and its role in social movements.", "name": "When Moore’s Law is Dead: Cloud Infrastructure Capacity and Machine Learning", "type": "Session"}, "161": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "11:15 AM", "end_PT": "11:45 AM", "start_ET": "02:15 PM", "end_ET": "02:45 PM"}, "categories": ["All"], "speakerIds": [], "description": "Join Dr. Jess Wade, 2020 Change Agent Abie Award Winner, as she speaks on her groundbreaking work as an online activist tackling gender and racial bias on Wikipedia. Dr. Wade is a physicist at Imperial College London.", "name": "Abie Award Series: 2020 Change Agent Award Winner", "type": "Session"}, "162": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "11:15 AM", "end_PT": "11:45 AM", "start_ET": "02:15 PM", "end_ET": "02:45 PM"}, "categories": ["Career", "Early Career"], "speakerIds": [86, 40], "description": "Own your career development from the start.  Develop a strategy of maximizing feedback to enhance your development and commit it to frequent practice.  In this presentation, we share actionable plans to be proactive and secure quality feedback.  Our recommended practices will be a useful aid in removing common obstacles in career progression.", "name": "Maximizing Feedback for Career Growth", "type": "Session"}, "163": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "11:15 AM", "end_PT": "11:45 AM", "start_ET": "02:15 PM", "end_ET": "02:45 PM"}, "categories": ["Diversity, Equity and Inclusion", "Senior/Executive"], "speakerIds": [173], "description": "The historic events of 2020 have only underscored the need for equity in all sectors, including tech. US tech corporations and leaders continuously tout their desire to create space for WOC in tech, yet WOC make up 4% of computing professionals. Joining the conversation is not the same as strategically addressing the solution. How can collective action lead to truly improved representation?", "name": "Less Blame, More Action: Centering Women of Color in Grantmaking to Diversify Tech", "type": "Session"}, "164": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "11:15 AM", "end_PT": "11:45 AM", "start_ET": "02:15 PM", "end_ET": "02:45 PM"}, "categories": ["Data Science", "Beginner"], "speakerIds": [479, 122], "description": "We collaborated with Peace Parks Foundation to help rangers detect potential poachers with computer vision. We use AI and the cloud to identify poachers from motion-activated cameras. With real-time alerts, the staff can intercept them. We will share our solution and the complexities we faced due to social justice and cultural issues in South Africa which are like the challenges faced globally.", "name": "Preventing Rhino Poaching through Machine Learning", "type": "Session"}, "165": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "11:15 AM", "end_PT": "11:45 AM", "start_ET": "02:15 PM", "end_ET": "02:45 PM"}, "categories": ["Product Management", "Intermediate"], "speakerIds": [364], "description": "Design Strategy is almost always thought of as a methodology for identifying requirements for a product that has a UI component. However, it is equally applicable in gathering requirements for API design, data and content. Join this Product Manager who has worked on travel APIs to see how Design Strategy can be adapted with ease to accessible API products that are usable by a diverse set of users.", "name": "Applying Accessibility and Gender sensitive Design Strategy to API Design", "type": "Session"}, "166": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "11:50 AM", "end_PT": "12:50 PM", "start_ET": "02:50 PM", "end_ET": "03:50 PM"}, "categories": ["Emerging Technology", "Intermediate"], "speakerIds": [232, 481, 431], "description": "Learn how drones aid in COVID-19 medical deliveries. In this hands-on workshop, you use a digital twin of a quadcopter to collect simulation data, analyze collision avoidance controls and test scenarios to ensure the drone can accomplish its critical mission. The digital twin uses a physics-based modeling approach and incorporates the droneís environment by streaming simulation data.", "name": "Digital Twins in a Pandemic: Use Simulation Data for Quadcopter Mission Planning", "type": "Session"}, "167": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "11:50 AM", "end_PT": "12:20 PM", "start_ET": "02:50 PM", "end_ET": "03:20 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Featured Session", "type": "Session"}, "168": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "11:50 AM", "end_PT": "12:20 PM", "start_ET": "02:50 PM", "end_ET": "03:20 PM"}, "categories": ["Data Science", "Beginner"], "speakerIds": [465, 347], "description": "The COVID-19 pandemic has led to a surge of digital transactions, between individuals, businesses, and governments. As a result, it becomes more critical than ever to improve fraud detection capabilities, at the same time reduce the impact to true customers. Join Capital One as we discuss designing, developing, and deploying real-time machine learning fraud solutions at scale.", "name": "Machine Learning-Based Decisioning Service Battling Fraudulent Transactions in Real-Time", "type": "Session"}, "169": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "11:50 AM", "end_PT": "12:50 PM", "start_ET": "02:50 PM", "end_ET": "03:50 PM"}, "categories": ["Career", "Senior Career"], "speakerIds": [103, 246, 135, 408, 437], "description": "Expectations are less explicit the further one climbs the executive ladder with implicit rules for success shared via informal relationships. Women of color arenít included in these networks and remain under-supported in leadership. Women leaders will share their experiences on succeeding while being authentic, especially in challenging times. Letís bring to light the unwritten rules of the game.", "name": "The Unwritten Rules of Leadership in Tech for Women of Color", "type": "Session"}, "170": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "11:50 AM", "end_PT": "12:50 PM", "start_ET": "02:50 PM", "end_ET": "03:50 PM"}, "categories": ["Emerging Technology", "Mid-Career"], "speakerIds": [340, 253, 29, 389], "description": "How do you dream up breakthrough technologies? What does it take to shape the future? What kind of team can bring radical creativity to life? We'll explore how to build a career in cutting-edge technology, hearing from women at Waymo, Wing, Loon and X, Alphabet's moonshot factory, which incubates moonshot technologies by applying audacious thinking and radical new technology to huge problems.", "name": "Building Your Path to the Moon: Kickstarting a Career in Taking Moonshots", "type": "Session"}, "171": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "11:50 AM", "end_PT": "12:20 PM", "start_ET": "02:50 PM", "end_ET": "03:20 PM"}, "categories": ["Software Engineering", "Intermediate"], "speakerIds": [68, 199], "description": "Moving to the cloud is a strategic transformation allowing you to pivot fast especially in COVID. Join us in learning to tango between business needs and cloud strategy, how to transform traditional software into cloud services, how to select service providers, and if to be cloud-agnostic. We'll discuss how to turn your organization into a highly responsive, diverse team with a DevOps model.", "name": "Cloud Architecture, Dev Ops, Inclusion: How to Tango", "type": "Session"}, "172": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "11:50 AM", "end_PT": "12:20 PM", "start_ET": "02:50 PM", "end_ET": "03:20 PM"}, "categories": ["Product Management", "Intermediate"], "speakerIds": [141], "description": "<div class=\"ag87-crtemvc-hsbk\"><div class=css-zuif4x><p class=\"carina-rte-public-DraftStyleDefault-block\"><span style=\"color: rgb(0,0,0);\">Tech is transforming emerging markets—but for too long, it has been in a bubble, forgetting to problem-solve for those who need it most. On a quest to better understand hard-to-reach consumers, Ginger has sought to bridge the gap between products and people. She will share stories of her time building products for \"forgotten\" customers and how tech is connecting them to the rest of the world.</span></p></div></div>", "name": "Finding the Human Behind Tech: Building Products for Emerging Markets", "type": "Session"}, "173": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "11:50 AM", "end_PT": "12:50 PM", "start_ET": "02:50 PM", "end_ET": "03:50 PM"}, "categories": ["Computer Systems Engineering", "Intermediate"], "speakerIds": [129, 93, 439, 71], "description": "<div class=\"ag87-crtemvc-hsbk\"><div class=css-zuif4x><p class=\"carina-rte-public-DraftStyleDefault-block\"><span style=\"color: rgb(0,0,0);\">Much of the conversation within organizational walls these days is around re-skilling workers – workers are fearful they will lose their jobs to robots and automation. In addition, society still remains suspicious of machines that make decisions on our behalf or seem to be tracking us (is this ‘big brother watching?). With all this animosity, why do we want to use these technologies?</span></p></div></div>", "name": "AI/ML and Bots; Friend or Foe", "type": "Session"}, "174": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "12:20 PM", "end_PT": "12:50 PM", "start_ET": "03:20 PM", "end_ET": "03:50 PM"}, "categories": ["Data Science", "Intermediate"], "speakerIds": [215], "description": "As part of our effort to improve customer experience, Walmart collects millions of surveys every month. From lifting survey response quality, to removing social biased feedback, we use deep learning and NLP to ensure that the voices of our customers are valid, heard, and acted on. Join us to hear the story of a smart system that works practically and empathetically to lift our stores daily.", "name": "How Walmart's Smart System Improved Retail Experience Through Deep Learning on Survey Data", "type": "Session"}, "175": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "12:20 PM", "end_PT": "12:50 PM", "start_ET": "03:20 PM", "end_ET": "03:50 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "PitcHER Networking", "type": "Session"}, "176": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "12:20 PM", "end_PT": "12:50 PM", "start_ET": "03:20 PM", "end_ET": "03:50 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Luncheon Celebrating LGBTQ-A in Technical Roles", "type": "Session"}, "177": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "12:20 PM", "end_PT": "12:50 PM", "start_ET": "03:20 PM", "end_ET": "03:50 PM"}, "categories": ["Product Management", "Intermediate"], "speakerIds": [421], "description": "So you're launching a new software product - what do you build first? And after that? Our world is changing every day ñ how do you handle these changes? At this talk you'll learn what to build and what not to build at each stage of your product launch. You'll also get valuable insights on topics like choosing your early adopters, go-live must-haves and realistic implementation timelines.", "name": "Your New Product: What to Build and When to Build It", "type": "Session"}, "178": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "12:20 PM", "end_PT": "12:50 PM", "start_ET": "03:20 PM", "end_ET": "03:50 PM"}, "categories": ["Computer Systems Engineering", "Advanced"], "speakerIds": [235], "description": "Apache Spark is a staple of production AI/ML workflows. The ETL phase that precedes the AI/ML phase has until recently been GPU agnostic. This talk covers how through cross-cultural open source collaboration, Apache Spark SQL is being accelerated on GPUs. The talk also presents results demonstrating better resource utilization and significantly reduced execution times on the order of 10-20x.", "name": "Accelerating Apache Spark ETL Workflows on GPUs: A Cross-cultural Open Source Initiative", "type": "Session"}, "179": {"date": {"start_date": "09/30/20", "end_date": "09/30/20", "start_PT": "12:20 PM", "end_PT": "12:50 PM", "start_ET": "03:20 PM", "end_ET": "03:50 PM"}, "categories": ["All"], "speakerIds": [], "description": "Join Dr. Olga Russakovsky, 2020 Emerging Leader Abie Award Winner, as she speaks on computer vision, AI bias, and the need to diversify the field of AI. Dr. Russakovsky is an Assistant Professor of Computer Science at Princeton University and Co-Founder of AI4ALL.", "name": "Abie Award Series: 2020 Emerging Leader Award Winner", "type": "Session"}, "180": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "07:00 AM", "end_PT": "08:00 AM", "start_ET": "10:00 AM", "end_ET": "11:00 AM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Meditation/Mindfulness", "type": "Session"}, "181": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "09:00 AM", "end_PT": "09:30 AM", "start_ET": "12:00 PM", "end_ET": "12:30 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Keynote", "type": "Session"}, "182": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "09:40 AM", "end_PT": "10:10 AM", "start_ET": "12:40 PM", "end_ET": "01:10 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Featured Session", "type": "Session"}, "183": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "09:40 AM", "end_PT": "10:10 AM", "start_ET": "12:40 PM", "end_ET": "01:10 PM"}, "categories": ["Emerging Technology", "Intermediate"], "speakerIds": [279, 192], "description": "Automation and inclusive design has empowered historically underserved populations via technology, but also opened the door for abuse. We are in a new era of automation with the introduction of ambient computing in the home - and although the opportunities for inclusive design and home automation are that much greater, we have a responsibility to consider the externalities of our work.", "name": "Home Automation and Inclusive Design", "type": "Session"}, "184": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "09:40 AM", "end_PT": "10:10 AM", "start_ET": "12:40 PM", "end_ET": "01:10 PM"}, "categories": ["Diversity, Equity and Inclusion", "Mid-Career"], "speakerIds": [180, 496], "description": "Do you want to form an Employee Resource Group but don't know where to begin? Do you lead an ERG that is struggling to succeed, especially with the challenges of COVID-19? We will present a model created by a group of women technologists who were looking to form a community at a large corporation. Six years later, it's a thriving ERG. We will share best practices, challenges, and future outlook.", "name": "How to Build and Maintain an ERG: Operational Strategies for Success", "type": "Session"}, "185": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "09:40 AM", "end_PT": "10:10 AM", "start_ET": "12:40 PM", "end_ET": "01:10 PM"}, "categories": ["Human Computer Interaction", "Beginner"], "speakerIds": [5], "description": "User research is more than just the data collection method--A/B testing, interviews, and usability testing are only half the story. This talk explores the less obvious half: study design, the framework for data collection. Without study design, we are not delivering people-relevant, high-impact findings. Listeners will learn six takeaways that they can start applying to their research tomorrow.", "name": "User Research Cannot Exist Without Study Design", "type": "Session"}, "186": {"date": {"start_date": "10/01/20", "end_date": "10/02/20", "start_PT": "09:40 AM", "end_PT": "05:30 PM", "start_ET": "12:40 PM", "end_ET": "08:30 PM"}, "categories": ["All"], "speakerIds": [], "description": "Open Source Day (OSD) is an all-day hackathon (including workshops) at vGHC, in which participants of all skill levels learn about Open Source while contributing to projects designed to solve real world problems. The goal of OSD is to promote Open Source contributions by women in tech. View the 2020 project here!", "name": "Open Source Day - Codeathon for Humanity", "type": "Session"}, "187": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "09:40 AM", "end_PT": "10:40 AM", "start_ET": "12:40 PM", "end_ET": "01:40 PM"}, "categories": ["All"], "speakerIds": [], "description": "Promote and support Black women technologists from industry, government, and academia. This session gives Black women a chance to network with one another, connect with strong role models, and celebrate their accomplishments.", "name": "Black Women in Tech Roles Networking", "type": "Session"}, "188": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "09:40 AM", "end_PT": "10:40 AM", "start_ET": "12:40 PM", "end_ET": "01:40 PM"}, "categories": ["Hardware", "Beginner"], "speakerIds": [355, 272, 469], "description": "Academics are increasingly researching the gap in technology access between communities. Drawing best practices from a Morgan Stanley program, this Workshop will teach participants how to unveil the magic behind technology to young people with limited access to computer science education through Adafruit CPX. Attendees will walk away with a Maker workshop blueprint for youth in their communities.", "name": "Maker Magic: Design a Blueprint for Community Tech Empowerment", "type": "Session"}, "189": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Diversity, Equity and Inclusion", "Mid-Career"], "speakerIds": [376, 78], "description": "Women of color have a unique disadvantage when it comes to building and finding community in the tech industry.Learn how to activate and energize underrepresented groups to lead the organization toward human connection, motivation, and belonging. By increasing visibility and creating an equitable framework, women of color will not only be engaged but can thrive.", "name": "Becoming Visible: Increasing Engagement & Talent Pipelines for Women of Color in Tech", "type": "Session"}, "190": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Human Computer Interaction", "Intermediate"], "speakerIds": [494], "description": "<div class=\"ag87-crtemvc-hsbk\"><div class=css-zuif4x><p class=\"carina-rte-public-DraftStyleDefault-block\"><span style=\"color: rgb(0,0,0);\">Swoop is a motion path tool developed to animate Gale, an invisible character in Walt Disney Animation Studios’ “Frozen 2”, by constructing the path on which she travels. We redesigned even the simplest features to ensure intuitive and predictable behavior, providing powerful editing features for the path’s shape and timing - empowering our artists to quickly experiment with Gale’s performance.</span></p></div></div>", "name": "Swoop: Developing an Animation Tool for an Invisible Character", "type": "Session"}, "191": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Security/Privacy", "Beginner"], "speakerIds": [400], "description": "I examine content moderation strategies employed by the three spheres of control over social media discourse, including citizen, corporation, and government. Implications for regulating interpersonal privacy violations and civil discourse on large-scale social issues of diversity are discussed.", "name": "User, Company, and Government Strategies for Preserving Civil Discourse on Social Media", "type": "Session"}, "192": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Product Management", "Intermediate"], "speakerIds": [205], "description": "Are features at the center of your product planning process? Then you are setting up your product team to fail. Building products is inherently complex and filled with uncertainty. Outcome-based planning can help manage that uncertainty. Learn the difference between outputs and outcomes, how to transition from focusing on outputs to focusing on outcomes and better manage uncertainty in product.", "name": "Manage your Unknown Unknowns: How to Lead with Outcomes to Manage Uncertainty in Product", "type": "Session"}, "193": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Career", "Early Career"], "speakerIds": [143], "description": "Doing the right thing. Speaking out against injustice and inequity. Showcasing our value at work. Managing careers as we lead our families through a global pandemic. Today's call for courage is felt in every aspect of our lives. Learn the origins of fear, the fear myth that holds us back at work, and strategies to break free of its grip to do the things we long to do \"if only we had the courage.\"", "name": "Inhale Courage, Exhale Fear", "type": "Session"}, "194": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Mid Career"], "speakerIds": [], "description": "", "name": "Mid-Career Networking", "type": "Session"}, "195": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Artificial Intelligence", "Beginner"], "speakerIds": [203, 119], "description": "We introduce Mica, a realistic virtual human driven by machine learning in a Spatial Computing system. We 1) explore how users interact with human-centered AI via insights from behavioral data, 2) show how machine learning can be applied to enhance and optimize behavior and 3) use a feminist perspective to explore the ethical implications of gendering AI.", "name": "Human-Centered AI", "type": "Session"}, "196": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Software Engineering", "Intermediate"], "speakerIds": [291, 315], "description": "Code reviews can sometimes be intimidating and stress inducing, however if well done they can really improve team coding, collaboration and create a culture of inclusion. This talk will give you confidence and improve your code reviews. We will focus on how you can find your voice during a review and learn how to contribute to a review regardless of your experience level or the power dynamic.", "name": "Find Your Voice as a Code Reviewer", "type": "Session"}, "197": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "10:45 AM", "end_PT": "11:15 AM", "start_ET": "01:45 PM", "end_ET": "02:15 PM"}, "categories": ["Career", "Early Career"], "speakerIds": [81], "description": "None of us want to work in places where people don't want us, or where we feel so different that we're not heard. Most of us will always try to fit in. However, up to which point we would yield just to fit in, in any environment? Learn how to set boundaries, especially as a minority voice, when trying to be part of any team and at the same time remain true to your authentic self.", "name": "Setting Boundaries at Work as a Minority Voice", "type": "Session"}, "198": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "10:45 AM", "end_PT": "11:15 AM", "start_ET": "01:45 PM", "end_ET": "02:15 PM"}, "categories": ["Interactive Media", "Intermediate"], "speakerIds": [184, 18], "description": "Voice interaction could be the medium of the future in a post-COVID, touch-free world. We offer a framework to evaluate the happiness of users as they interact with voice assistants. Using real data from Cisco Webex Assistant, we'll discuss what a conversation is and how we capture something as subjective as feelings. Join us to hear how we built & validated a data-driven user satisfaction system.", "name": "Are You Happy?  Data Driven Assessment of User Satisfaction in Voice Assistants", "type": "Session"}, "199": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": ["Career", "Intermediate"], "speakerIds": [201, 50, 498, 107, 262], "description": "This panel will explore opportunities for using AI/ML techniques to build and run complex 5G networks that meet the quality-of-experience needs. Broadly viewing 5G wireless edge as an integrated compute-communication engine for distributed and real-time learning enables the compute needs for AR/VR, industrial robotics, cognitive video, and drone applications etc.", "name": "5G, AI and ML: How communications drives opportunities", "type": "Session"}, "200": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "10:45 AM", "end_PT": "11:15 AM", "start_ET": "01:45 PM", "end_ET": "02:15 PM"}, "categories": ["Hardware", "Intermediate"], "speakerIds": [91], "description": "Now more than ever, we are acutely aware of our interactions with people and surfaces. Learn how ambient intelligence - the combination of artificial intelligence and multi-sensory technology ñ can help reduce the complexity of complying with new COVID-19 health mandates by providing remote temperature checking, mask screening, social distancing, and touchless voice solutions.", "name": "Mirror, Mirror on the Wall: Where Did My Computer Go?", "type": "Session"}, "201": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": ["Diversity, Equity and Inclusion", "Early Career"], "speakerIds": [417, 266], "description": "Are you inspired to create a sense of community at work? Do you see opportunity for the employee experience to improve at your workplace? If you answered yes to either of these questions then you are a candidate to create or reinvigorate affinity groups (ERG) at your workplace. In this workshop you will learn practical steps to build your affinity group (ERG) and create change at your company.", "name": "Forming Affinity Groups: Turn a Social Club into a Program That Makes Impact", "type": "Session"}, "202": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": ["Career", "Intermediate"], "speakerIds": [116, 134, 480, 398, 53], "description": "Product Management and Strategy are two pillars upon which every successful product is built. The interplay between the two has been even more starkly revealed during COVID-19, as the art of product development goes through an extensive transformation. In this panel, you will hear from product managers and strategists navigating the crisis in B2B, B2C, Start up and Non Profit environments", "name": "Blurring the Lines: Strategy & Product Management in Times of Crisis", "type": "Session"}, "203": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "10:45 AM", "end_PT": "11:15 AM", "start_ET": "01:45 PM", "end_ET": "02:15 PM"}, "categories": ["Software Engineering", "#N/A"], "speakerIds": [147, 133], "description": "The ability to share insights in a manner that is both accessible and customizable is an impediment to business and data science collaboration. By utilizing open source technology and DevOps practices, Target unlocked a new pattern for dashboard development that expedites insights with data, increases productivity in remote work environments, and reflects a culture of allyship for women in tech.", "name": "DevOps + Data Science: Reduce Time to Data Driven Decisions", "type": "Session"}, "204": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "11:15 AM", "end_PT": "11:45 AM", "start_ET": "02:15 PM", "end_ET": "02:45 PM"}, "categories": ["Software Engineering", "Intermediate"], "speakerIds": [185, 420], "description": "With an increased demand for resilient infrastructure that scales and adapts to both consumer and enterprise needs in the COVID era, businesses need to adopt Chaos Engineering. Itís a discipline that forces injecting planned disruptions to gain confidence that apps are resilient during an outage. In this session, weíll walk through a 5-step iterative approach to getting applications chaos-ready.", "name": "Get Your App Ch@0$-Ready & Go Fail Yourself", "type": "Session"}, "205": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "11:15 AM", "end_PT": "11:45 AM", "start_ET": "02:15 PM", "end_ET": "02:45 PM"}, "categories": ["Security/Privacy", "Beginner"], "speakerIds": [269], "description": "The number of phishing attacks is steadily increasing as a popular attack vector toward potential victims. During this talk 3 researches Fox-IT performed about how people are being influenced with phishing emails will be presented. What sociotechnical techniques do attackers (and ethical hackers) use to trick the human mind? And how can we use this knowledge to improve security awareness programs?", "name": "Improve Security Awareness Campaigns by Applying Phishing Research", "type": "Session"}, "206": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "11:15 AM", "end_PT": "11:45 AM", "start_ET": "02:15 PM", "end_ET": "02:45 PM"}, "categories": ["Human Computer Interaction", "Intermediate"], "speakerIds": [158, 483], "description": "Understanding human perspective is critical as the world adopts ambient technologies that recognize human faces, voices, activities, and even thoughts as they move through the physical world. We will present our work and findings from generating and testing use cases for smart environments, revealing insights for a path forward that provides value to both individuals and organizations.", "name": "Making Smart Spaces Human: Ambient Technologies that Enhance Life and Work", "type": "Session"}, "207": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "11:15 AM", "end_PT": "11:45 AM", "start_ET": "02:15 PM", "end_ET": "02:45 PM"}, "categories": ["Career", "All"], "speakerIds": [379], "description": "Already facing millions of jobs lost worldwide to automation, we now face a dramatic shift in our work and education environments. There is no greater resource than our creativity and innovation in responding to these shifting paradigms. In our approach to technology and leadership, how can we redefine our narrative and priorities to ensure we adapt with intention, ingenuity and inclusivity?", "name": "Optimism in Our Adaptability - The Revolution in Work is Here", "type": "Session"}, "208": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "11:50 AM", "end_PT": "12:20 PM", "start_ET": "02:50 PM", "end_ET": "03:20 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Featured Session", "type": "Session"}, "209": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "11:50 AM", "end_PT": "12:20 PM", "start_ET": "02:50 PM", "end_ET": "03:20 PM"}, "categories": ["Diversity, Equity and Inclusion", "Senior/Executive"], "speakerIds": [397, 4], "description": "Companies today are seeking to create diverse teams, but how can we build truly diverse teams if we continue to source talent from the same places? Apprentice programs address talent needs using non-traditional sources, increase workforce diversity, and create opportunities for underrepresented groups. We'll examine how to use apprenticeships to solve representation challenges and tech skill gaps.", "name": "Battling Skill Gaps & Representation Challenges in Tech with the Apprenticeship Model", "type": "Session"}, "210": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "11:50 AM", "end_PT": "12:10 PM", "start_ET": "02:50 PM", "end_ET": "03:10 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Latinas in Technical Roles", "type": "Session"}, "211": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "11:50 AM", "end_PT": "12:50 PM", "start_ET": "02:50 PM", "end_ET": "03:50 PM"}, "categories": ["Security/Privacy", "Beginner"], "speakerIds": [304, 429, 353], "description": "Cybercrime isn't just about malware. Cyberstalking, cyberbullying/harassment, non-consensual pornography, these all disproportionately affect women.  As we spend more time online due to COVID19, and find ways to be a voice for our communities, digital safety is more and more important.  Learn the challenges that affect women's online presence and how to mitigate/anticipate these risks.", "name": "Digital Safety For Women", "type": "Session"}, "212": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "11:50 AM", "end_PT": "12:50 PM", "start_ET": "02:50 PM", "end_ET": "03:50 PM"}, "categories": ["Software Engineering", "Intermediate"], "speakerIds": [357, 432], "description": "Thinking about how to best contribute to your community using simple technology? Want to bring awareness about the pandemic, social issues & local businesses? Attend our hands-on AWS tech workshop where you will learn how to host a community news bulletin to make that a reality! Participants walk away with knowledge of serverless architecture on AWS and a self-guided workbook for future reference.", "name": "Want to Educate Your Community During the Pandemic? Build your Platform Using AWS Tech!", "type": "Session"}, "213": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "11:50 AM", "end_PT": "12:20 PM", "start_ET": "02:50 PM", "end_ET": "03:20 PM"}, "categories": ["Computer Systems Engineering", "Intermediate"], "speakerIds": [117], "description": "Data center production networks are intricate and undergo constant churns. Network reliability is critical. One way to minimize downtime due to configuration changes is to validate network operations in a high-fidelity network emulator. This tool has enabled us to spin up new capacity faster where it was needed in the context of the world shifting to the virtual platform for daily transactions.", "name": "Emulate the Change you Want to see in your Network!", "type": "Session"}, "214": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "11:50 AM", "end_PT": "12:50 PM", "start_ET": "02:50 PM", "end_ET": "03:50 PM"}, "categories": ["Career", "Mid-Career"], "speakerIds": [318, 123], "description": "Feel confident you can negotiate for what you’re worth! You might have been told you are supposed to negotiate - your salary, your role, your boundaries but struggled translate this into action. Join us for an interactive workshop where you will learn actionable tactics like how to understand analyze incentives, learn how to say no constructively, and role-play a real world scenario.", "name": "Negotiate with Confidence in 60 minutes", "type": "Session"}, "215": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "11:50 AM", "end_PT": "12:20 PM", "start_ET": "02:50 PM", "end_ET": "03:20 PM"}, "categories": ["Human Computer Interaction", "Beginner"], "speakerIds": [370], "description": "Events in 2020 emphasize that our lives are more than ever dependent on computers which ensures our ability to stay connected. However, for individuals with paralysis, interaction with computers is challenging, which often results in their loss of independence. We present on a discreet oral wearable device that enables interacting with computers using the swipe of the tongue on the palate.", "name": "Wearable Technology to the Rescue: Human Computer Interaction via Oral Assistive-Devices", "type": "Session"}, "216": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "12:20 PM", "end_PT": "12:50 PM", "start_ET": "03:20 PM", "end_ET": "03:50 PM"}, "categories": ["Artificial Intelligence", "Advanced"], "speakerIds": [475], "description": "Cell imaging plays an important role in the fields of medicine and biology. Analyzing label-free cell images has many challenges for traditional computer vision. We investigate ways of augmenting limited availability of training data with pix2pix GAN, and applied U-Net to perform semantic segmentation. We demonstrated segmenting and classifying stain-free cells successfully.", "name": "Label-Free Cell Image Semantic Segmentation with U-Net", "type": "Session"}, "217": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "12:20 PM", "end_PT": "12:50 PM", "start_ET": "03:20 PM", "end_ET": "03:50 PM"}, "categories": ["Product Management", "Intermediate"], "speakerIds": [495, 22], "description": "Unlike customer facing applications, platform products tend to have many groups of stakeholders from whom feature requests originate. Those requests are often presented with qualitative pleas influenced by bias, emotion, or power. This data-driven prioritization framework aims to mitigate the impact of those factors on creating inclusive platforms and to help guide scrum team ceremonies.", "name": "Data-Driven Prioritization Framework for Platform PMs", "type": "Session"}, "218": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "12:20 PM", "end_PT": "12:50 PM", "start_ET": "03:20 PM", "end_ET": "03:50 PM"}, "categories": ["Emerging Technology", "Beginner"], "speakerIds": [459, 345], "description": "The presentation will cover blockchain and IoT concepts, including an overview of blockchain and typical IoT blockchain solution examples. Through use case studies related to Covid-19, we will help the audience understand the power of applying IoT and blockchain technology to solve some problems that really matter in your daily life.", "name": "IoT + Blockchain: Why Does it Matter to You?", "type": "Session"}, "219": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "12:20 PM", "end_PT": "12:50 PM", "start_ET": "03:20 PM", "end_ET": "03:50 PM"}, "categories": ["Security/Privacy", "Beginner"], "speakerIds": [413], "description": "In a highly digitized world, using digital identity to access information is becoming a daily routine. The COVID-19 pandemic has further accelerated the digital shift, turned the work-from-home practice to a new normal, but also opened new doors to identity theft. Find out the common identity cyber threats in this presentation and apply simple techniques to protect identity in your daily lives.", "name": "Identity Theft & Protection: Safeguard your Identities in Professional & Personal Lives", "type": "Session"}, "220": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "12:20 PM", "end_PT": "12:50 PM", "start_ET": "03:20 PM", "end_ET": "03:50 PM"}, "categories": ["Human Computer Interaction", "Beginner"], "speakerIds": [83, 388], "description": "COVID-19's impact has emphasized technology's important role in helping us adapt to all situations and people. With accessibility being a driving force for innovation in UX, we will explore how to teach empathy and inclusive thinking in students, by rethinking the games of UNO and Twister. We'll also discuss ways to conduct this workshop virtually and with a wider audience in this 'new normal'.", "name": "Inviting Everyone to Game Night: Using Accessibility to Build Empathy in Students", "type": "Session"}, "221": {"date": {"start_date": "10/01/20", "end_date": "10/01/20", "start_PT": "01:00 PM", "end_PT": "01:30 PM", "start_ET": "04:00 PM", "end_ET": "04:30 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Keynote", "type": "Session"}, "222": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "07:00 AM", "end_PT": "08:00 AM", "start_ET": "10:00 AM", "end_ET": "11:00 AM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Liquid Metal Yoga", "type": "Session"}, "223": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "09:00 AM", "end_PT": "09:30 AM", "start_ET": "12:00 PM", "end_ET": "12:30 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Keynote", "type": "Session"}, "224": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "09:40 AM", "end_PT": "10:10 AM", "start_ET": "12:40 PM", "end_ET": "01:10 PM"}, "categories": ["All"], "speakerIds": [], "description": "Ever feel you're missing a chance to have a greater impact in your 9 to 5? Join us for a conversation between those who took the leap from the private sector to working in government and public service. Speakers will discuss how they made the change and they purpose they found working towards a different, mission-driven bottom line.", "name": "A Better Bottom Line: Careers in Public Service", "type": "Session"}, "225": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "09:40 AM", "end_PT": "10:10 AM", "start_ET": "12:40 PM", "end_ET": "01:10 PM"}, "categories": ["All"], "speakerIds": [], "description": "Don't miss this fireside chat between AnitaB.org CEO Brenda Darden Wilkerson and Minda Harts, CEO of The Memo LLC, a career development platform for women of color. Together they will be discussing strategies for managing diverse talent, advancing women in the workplace, and leadership development. Join us for a conversation about strategies to empower your own career while lifting others in the process.", "name": "The Memo with Minda Harts", "type": "Session"}, "226": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "09:40 AM", "end_PT": "10:10 AM", "start_ET": "12:40 PM", "end_ET": "01:10 PM"}, "categories": ["All"], "speakerIds": [], "description": "BRAID is a national initiative to increase the representation of women and URM students in undergraduate computing. This session will focus on what the BRAID Research team has learned, sharing the latest results and discussing implications of findings for computing departments. Findings related to the progress BRAID schools have made in diversifying computing majors will be shared.", "name": "Reflections on Six Years of BRAID Research", "type": "Session"}, "227": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "09:40 AM", "end_PT": "10:40 AM", "start_ET": "12:40 PM", "end_ET": "01:40 PM"}, "categories": ["Virtual, Augmented, and Mixed Reality", "Beginner"], "speakerIds": [223, 212, 30], "description": "Welcome to the world of augmented reality and artificial intelligence! This workshop explains AR and AI via hands-on exercises where you build a game to interact with your augmented world. You will learn about the novel applications of AR+AI, their limitations and social impacts amplified by COVID-19. You'll leave armed with code, inspiration and an ethical framework for your own projects!", "name": "Do You See What I See: Using AR and AI", "type": "Session"}, "228": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "09:40 AM", "end_PT": "10:10 AM", "start_ET": "12:40 PM", "end_ET": "01:10 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Featured Session", "type": "Session"}, "229": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "09:40 AM", "end_PT": "10:40 AM", "start_ET": "12:40 PM", "end_ET": "01:40 PM"}, "categories": ["Open Source", "Beginner"], "speakerIds": [458, 139], "description": "With jobs lost from COVID-19, it can be hard to learn new skills and build out a portfolio. Open source provides opportunities for both, and you can even get paid by a GitHub sponsor. Learn (1) how easy it is to contribute to open source, and (2) the first steps to get started on making your first contribution. By doing so, you are increasing the 6% of women in the Open Source community!", "name": "Welcome to Open Source, Women!", "type": "Session"}, "230": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "09:40 AM", "end_PT": "10:10 AM", "start_ET": "12:40 PM", "end_ET": "01:10 PM"}, "categories": ["Interactive Media", "#N/A"], "speakerIds": [346], "description": "<div class=\"ag87-crtemvc-hsbk\"><div class=css-zuif4x><p class=\"carina-rte-public-DraftStyleDefault-block\"><span style=\"color: rgb(0,0,0);\">It starts like a bad joke: a dancer and an engineer walk into a room. But what emerges isn’t a punchline–it’s a powerful culture shift at the intersection of art, technology, and innovation. This talk examines and analyzes historical and emerging tech trends in the performing arts, with an emphasis on dance applications (“dancetech”). All are welcome, even those with two left feet!</span></p></div></div>", "name": "It Takes Tech to Tango: An Introduction to DanceTech", "type": "Session"}, "231": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "09:40 AM", "end_PT": "10:10 AM", "start_ET": "12:40 PM", "end_ET": "01:10 PM"}, "categories": ["Career", "Mid-Career"], "speakerIds": [500], "description": "The more risks you successfully navigate, the more confident you will become, and the more risks you will be willing to take. It's a virtuous cycle. Learn how to get comfortable with more risk in your work to accelerate your opportunities and fuel your advancement. These skills can also help you face your personal prejudices and fight for justice for all people.", "name": "To Succeed Faster, Get Comfortable With Risk", "type": "Session"}, "232": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Career", "Mid-Career"], "speakerIds": [167], "description": "Did you ever wonder how and why some leaders like Steve Jobs, Elon Musk, and Meg Whitman make their way to the top and are so successful? What makes them different? Leadership is the capacity to translate vision into reality. Each and every one of you is capable of climbing that ladder. Learn what are the traits of a leader that help them grow into senior management position and be successful.", "name": "Traits Of A Successful Leader", "type": "Session"}, "233": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Diversity, Equity and Inclusion", "All"], "speakerIds": [348], "description": "<div class=\"ag87-crtemvc-hsbk\"><div class=css-zuif4x><p class=\"carina-rte-public-DraftStyleDefault-block\"><span style=\"color: rgb(0,0,0);\">This talk focuses on approaches to mentoring nontraditional students with a ‘hidden’ status: incarceration history. Several organizations now provide tech education in prisons, pairing graduates with internships and mentors on release.</span></p><p class=\"carina-rte-public-DraftStyleDefault-block\"><span style=\"color: rgb(0,0,0);\">Learn how to set mentees up for success with insight and concrete skills that aim to provide an identity-affirming, holistic, and encouraging experience.</span></p></div></div>", "name": "Inclusivity Power-Up:  Lessons Learned Mentoring Formerly Incarcerated Software Engineers", "type": "Session"}, "234": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Hardware", "Beginner"], "speakerIds": [482], "description": "The pandemic has made healthier environments the need of the hour. At the same time, national protests around racial injustice underscore the need for technology that is conscious of people's privacy and biases. Our future cities need smarter and more sustainable infrastructure. Through user scenarios, this talk presents a vision of how smart materials could enable more human-centric smart cities.", "name": "Living in the Material World: Reconciling Humans and Technology Through Smart Materials", "type": "Session"}, "235": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Hardware", "Beginner"], "speakerIds": [12], "description": "With increasing complexity in chip designs, verifying the design functionality has become not just more imperative, but also harder. Traditional verification strategies revolve around constrained random simulation, but these are highly resource intensive. We explore Machine-Learning based techniques in a traditional engineering process while challenging preconceived notions about productivity.", "name": "Improving Engineering Productivity using Machine-Learning for Hardware Verification", "type": "Session"}, "236": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Career", "All"], "speakerIds": [38], "description": "The COVID-19 pandemic has added enough challenges to caregiving that many women are considering reducing their work commitments or taking a career hiatus. This can dramatically impact the momentum of any career in a fast-paced technology field. We will discuss strategies for staying relevant in the field, rejoining the workforce, and coming back as stronger and more well-rounded professionals.", "name": "Strategies for Re-entering the Workforce in the Time of COVID-19", "type": "Session"}, "237": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Interactive Media", "Intermediate"], "speakerIds": [321], "description": "The 2020 pandemic led to unprecedented disruption in human interaction, driving people to rely on tech for connections. Growing up with social gaming platforms like Roblox, kids and teens showed resilience continuing to socialize online. This presentation will examine the impact of social distancing on online connections and identities, rooted in data and trends from a 120M+ gaming community.", "name": "Satisfying The Need For Human Connection: How A 120 Million+ Community Gamed The Pandemic", "type": "Session"}, "238": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["Software Engineering", "Intermediate"], "speakerIds": [161], "description": "Modern front-end frameworks alone can't save you if your data store is poorly structured. Frameworks provide state and data flow management, but do not impose the structure of the store. Come learn about common pitfalls we encountered with React-Redux and how data store best practices learned from Redux apply across front-end frameworks such as Apollo Client's in-memory cache.", "name": "Whip Your Data Store Into Shape: Redux Best Practices Applied To Apollo In-Memory Cache", "type": "Session"}, "239": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:10 AM", "end_PT": "10:40 AM", "start_ET": "01:10 PM", "end_ET": "01:40 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "Systers Pass It On Award Winners Presentations", "type": "Session"}, "240": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:15 AM", "start_ET": "01:45 PM", "end_ET": "02:15 PM"}, "categories": ["All"], "speakerIds": [], "description": "An exclusive vGHC screening of Coded Bias, a documentary by Shalini Kantayya featuring Joy Buolamwini. When MIT Media Lab researcher Joy Buolamwini discovers that most facial-recognition software does not accurately identify darker-skinned faces and the faces of women, she delves into an investigation of widespread bias in algorithms.", "name": "Coded Bias Screening", "type": "Session"}, "241": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:15 AM", "start_ET": "01:45 PM", "end_ET": "02:15 PM"}, "categories": ["Tech for Women", "Beginner"], "speakerIds": [470], "description": "FemTech refers to diagnostics, apps and wearables that empower individuals to take control of their own health and wellness, and is projected to be a $50B market by 2025. The industry, full of female founders, is bringing awareness to the differences between how we care for the male and female body. Learn about how FemTech is transforming healthcare and changing the way we create & use technology.", "name": "Transforming Healthcare and Empowering Women With FemTech", "type": "Session"}, "242": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [92], "description": "Mentorship plays a key role in helping women advance at work, especially in tech industry. We all know that mentors are important, but what does a mentor really do for you, and how to get the most out of it? This session offers you helpful insights and tips for answering those questions.", "name": "The Value of Mentors and How to Get the Most out of it", "type": "Session"}, "243": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": ["Career", "Mid-Career"], "speakerIds": [35, 409, 306, 138, 361], "description": "<div class=\"ag87-crtemvc-hsbk\"><div class=css-zuif4x><p class=\"carina-rte-public-DraftStyleDefault-block\"><span style=\"color: rgb(51,51,51);\">“Breadwinner.” “Bringing home the bacon.” “Meal-ticket.” Being the sole income earner for a family is a demanding, stressful, and often isolating role. Come hear from a diverse group of women about their experiences and how you can balance the demands in life.</span></p></div></div>", "name": "Sole Income Earner Panel", "type": "Session"}, "244": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [457], "description": "There are many misconceptions about what it means to be a woman in technology. For some, the path to success may be filled with coding and hardware configuration. For others, it may look a little different, a little less technical. Just because you donít possess the skills (or the desire) to be proficient in highly technical subjects does not mean you cannot be a successful woman in technology.", "name": "How Can I Be a Woman in Technology If I'm Not Technical?", "type": "Session"}, "245": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [248], "description": "You've just been invited to interview with a company. Feeling the pressure? Whether it be a virtual or in-person interview, the best way to combat nerves is to be prepared. In this mentoring circle, an expert recruiter shares what hiring managers look for in job candidates and how to prepare for a successful conversation, present yourself professionally and land the second interview.", "name": "How to Make a Great First Impression and Land the Second Interview", "type": "Session"}, "246": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [69, 365], "description": "During these times of social injustice, we will learn techniques to use during courageous conversations by exploring how to find a neutral starting position, remove roadblocks and leverage reflective listening skills.  Through role play, participants will share experiences using the three key points, know the issues and gain perspective, be intentional, and demonstrate understanding and empathy.", "name": "How to Have a Courageous Conversation To Get Past \"No\"", "type": "Session"}, "247": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [443, 132], "description": "Looking for a technical alternative to management as a way to advance your career? Come learn about the \"architect\" role: what we do, what skills are needed and why it's rewarding. Two architects share their experiences and tools to evaluate if the role is a good fit for you. They will also discuss how to build the influence you need to drive technology decisions, while we all work from home.", "name": "Is the Architect Role in Your Career Path? Architects & What They Do, Why & How", "type": "Session"}, "248": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [65, 425], "description": "Creativity and technology tend to be placed in opposing buckets, but an interdisciplinary approach is necessary in order to envision innovative solutions to problems and utilize technology for social good. As creative technologists, we utilize a process entitled the 12-week hack to brainstorm and prototype. In this session, we'll show you how this process can help you develop your next great idea!", "name": "How to Think Like a Creative Technologist", "type": "Session"}, "249": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [171], "description": "Venturing into the technology industry is exciting and rewarding, but the assumption that a particular job requires a specific degree can prevent aspiring candidates from embarking on a fulfilling career. Discover how your background enables you to bring creative perspectives to the IT world and learn transformative strategies to confidently and courageously embrace the journey!", "name": "I'm Going on an Adventure: Making Your Way in an Unexpected (Career) Journey", "type": "Session"}, "250": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [329], "description": "Technical interviews are stressful to say the least. As a candidate, you're typically only given five to ten minutes at the end of an interview to ask questions. How can you tell in that time if this is an inclusive work environment that you would want to be a part of? This session provides tips and tricks for figuring this out as you navigate the entire interview process.", "name": "Interviewing the Interviewer: Evaluating for Inclusivity with Minimal Information", "type": "Session"}, "251": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [297], "description": "High-powered women are always thinking about their next step. During undergrad and post-graduation, women often question whether to pursue an MBA. This Mentoring Circle will discuss whether an MBA is right for you, how to get into the right school, how an MBA can boost your career, and the impact of social justice movements and the COVID-19 pandemic on MBA admissions and programs.", "name": "High-Powered Women Always Think Ahead: Here Is What You Should Consider for Business School", "type": "Session"}, "252": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [243, 148], "description": "Cyber is one of the fastest growing industries in the world and is facing unprecedented demand for talent, remaining resilient to economic uncertainty and a global pandemic. Whether you're preparing to enter the workforce or pivoting your career, this session is for you. Attendees will learn about the evolving Cyber landscape, career paths, in-demand skills, and tips for navigating a Cyber career.", "name": "Cyber wants YOU!", "type": "Session"}, "253": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [46], "description": "In tech, a big challenge when searching for a new job is often not lack but abundance of opportunities. How to make the right choice? This session will offer a relaxed perspective on team search, with plenty of opportunities for self-reflection and dialog. Attendees will gain an understanding of what makes up good and bad team choices for them, and tools they can use on their next job search.", "name": "Choosing Your Next Team or Job", "type": "Session"}, "254": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [54], "description": "Want to land your first software engineering job, but aren't really sure how? Never fear, this mentoring session will give you insights from an experienced interviewer. We will cover how many companies have adjusted their interviewing practices in response to Covid-19 and brainstorm what unique personal strengths and experiences you can highlight to put your best foot forward.", "name": "Ace the Interview: How to Land Your First Software Engineering Job", "type": "Session"}, "255": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [341, 39], "description": "There will be about 3.5 million cyber security jobs by 2021, but as of today, only 20% of those jobs are held by women. We will discuss current opportunities in this field, why increasing diversity is important, provide guidance on what cyber security means, the impact of COVID-19 on security and the opportunities arising from it, as well as roles and skills needed to pursue a career in it.", "name": "Now Is The Best Time For Women To Start A Career In Cyber Security!", "type": "Session"}, "256": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [387, 211], "description": "Are you excited by the pace of change in tech and the opportunity to learn constantly on the job? Are you an astute listener and aspiring presenter who likes solving problems? Do you value a flexible schedule and options to work effectively in person or FROM HOME? Join us to explore how your DIVERSITY and a passion for tech can help you build - or shift to - a rewarding career in technical sales.", "name": "Have a Blast Building a Rewarding and Lucrative Career as a Sales Engineer, Even Remotely!", "type": "Session"}, "257": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [299], "description": "From afar, the product manager role can sometimes feel like an enigma. This session aims to demystify product management as a career and help students & new grads be scrappy about gaining a product sense. How can we draw parallels between product strategy and our everyday decision-making? Oftentimes, some of the most ordinary tools and experiences can help us evolve into the best product managers.", "name": "From College Student to Product Manager: Being Scrappy About Developing Your Product Chops", "type": "Session"}, "258": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [105], "description": "Patents are a key indicator of success in STEM industries. In 2015, women comprised about 28% of the STEM workforce, yet only represented 12% of inventors. This dialogue describes the importance of patents, why a gender disparity exists in inventorship, and how it may be remedied. Attendees will walk away from this presentation feeling knowledgeable and confident to seek patents of their own.", "name": "Pretty in Patents: Closing the Inventorship Gender Gap", "type": "Session"}, "259": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [463, 34], "description": "Cultivating deeper relationships within your network is more impactful and reaps more benefits than a wide, but shallow network pool. This session will guide you through the do's and don'ts of building your dream network during these unprecedented times and how we must open ourselves up to crucial perspectives and insights by pursuing a network that is both gender and ethnically diverse.", "name": "Building Your Dream Network", "type": "Session"}, "260": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [287], "description": "Your career can sometimes resemble the journey of a butterfly. You start out in one form, but to reach your full potential, growth and transformation must occur. As women and sometimes also being an underrepresented minority in technology, that journey in some instances is alone. Let's talk about navigating career paths, pivoting and using challenges such as solitude as strength to drive change.", "name": "The Butterfly Code: Embracing Change Along Your Technology Journey", "type": "Session"}, "261": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": ["All"], "speakerIds": [], "description": "Turning your idea into a money-making business can be a daunting task, but you can do it! During this workshop, Founder Gym’s CEO, Mandela SH Dixon, will share her proven framework that has helped entrepreneurs around the world transform their ideas into a business that can thrive in any market conditions. All attendees will receive a special guide that makes it simple to apply Mandela’s framework right away.", "name": "How to Turn Your Idea Into a Money-Making Business", "type": "Session"}, "262": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [98], "description": "Women are known to face challenges advocating for themselves at work, especially when asking for a promotion. Faced with a lack of mentors, many women are deprived of guidance on how to strategically approach this critical process. In this dialogue, I will walk through a simple and effective 3-step framework. This will help women own their narrative and get rewarded for their accomplishments.", "name": "Advocating for Your Promotion During Uncertain Times", "type": "Session"}, "263": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [9], "description": "Over the course of your career you will encounter all kinds of managers. The best managers have your back, but what happens when they are too focused on the work and not enough on your development and advancement? This circle explores how to recruit your manager to champion your career development, led by two senior women who are passionate about coaching technical women and conflict resolution.", "name": "How to Manage Your Manager", "type": "Session"}, "264": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [405], "description": "Innovation and collaboration are the hallmarks of the tech industry. Making sure that your ideas are respected and your opinions are heard can be tough, at work and in life. Whether presenting a new idea to your team, troubleshooting a customer outage or lobbying government for legislative change, certain strategies will improve the outcome for everyone and ensure that your initiatives are valued.", "name": "Get to Yes: The Art of Persuasion", "type": "Session"}, "265": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [317], "description": "A one-on-one is time with your manager to talk about you, your goals and work through any issues you may be facing. If you donít vocalize your objectives and concerns, your manager can't help you. During these unprecedented times, in which we are all stretched thin, you need the skill set necessary to drive your one-on-one, manage up and advocate for yourself to get the opportunities you deserve.", "name": "Take Ownership of Your One-on-One", "type": "Session"}, "266": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [363], "description": "Navigating the corporate ladder can be challenging for introverts in companies where the culture promotes people who are outgoing / extroverted. This session is aimed at providing some smartcuts (smarter way of doing things) for introverts to advance their career while being true to their personality in an authentic and sustainable way and are applicable even in our current turbulent times.", "name": "Smartcuts for Introverts to Advance Their Career", "type": "Session"}, "267": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [186], "description": "In the professional world it is common to own a project you may not know how to start and getting help can be intimidating. Knowing when and how to ask for help is a critical skill that benefits the individual and their team. With the right set of techniques, those early in their career can hone that skill in a remote environment and use it to optimize productivity and maximize learnings.", "name": "Owning your Work Environment: How to Tackle New Challenges and Ask for Help in a Remote Workplace", "type": "Session"}, "268": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [392], "description": "Imposter syndrome is debilitating, even more so for women and minorities. The gender gap and unconscious biases can add to the stressors of being \"not good enough.\" This feeling can hinder performance and even lead to leaving the field completely. By learning and practicing new behaviors to grow self-confidence, we can overcome imposter syndrome and be proud of who we are and what we know.", "name": "Conquering Imposter Syndrome", "type": "Session"}, "269": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [17], "description": "Although most employers identify diversity as a priority, many employees face challenges in the workplace related to their race, gender, sexual orientation, and/or ability status. These challenges can be daunting to voice as a professional. As the social justice movement shows however, every voice can impact change. Attendees will leave this session empowered with tactical tips on allyship.", "name": "Do the Real Work: How to be an ally in the workplace", "type": "Session"}, "270": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [399], "description": "In your career, do you need a coach? Mentor? Sponsor? How do you know which one? You need all three and this should start as early as possible! This discussion will focus on the differences in a coach, mentor, and sponsor, the goals of each relationship, and identifying people that fit each category. Participants will leave this session prepared to champion their career growth and success!", "name": "Coaching vs Mentorship vs. Sponsorship  And Why You Want Them All!", "type": "Session"}, "271": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [20, 130], "description": "87% of professionals are passionate about their job, but 64% are also stressed, dispelling the myth that engaged employees are immune to burnout (Deloitte). During this unprecedented time, the high levels of uncertainty can lead to burnout. This session will give you the tools to recognize, prevent and overcome burnout - equipping you with the ability to move from burnout to breakthrough thinking!", "name": "From Burnout to Breakthrough", "type": "Session"}, "272": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [285, 380], "description": "Have you taken a break from your job (either voluntarily or due to external factors) and are now trying to re-enter the workforce? Have you ever considered taking a break but were afraid? Join us for an interactive dialogue to gain actionable insights on handling the \"return-to-work\" journey. Julia has recruited returnees at Walmart and Deepthi is an ex-returnee who mentors other returnees.", "name": "Career Gap: Embrace and be Emboldened", "type": "Session"}, "273": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [343], "description": "Covid-19 and social injustice issues impacted mental health of all, and disproportionately impacted mental health of racial minorities. Having your career hindered by stress, depression is tiresome and make you feel stuck. This dialog shares practical tips for coping with mental health issues to thrive in your career. Attendees will feel empowered to create a community with improved mental health.", "name": "How to Care for Your Mental Health in 2020 and Beyond?", "type": "Session"}, "274": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [270], "description": "Post-COVID professional environments are extremely competitive, and it is hard to take your career to the next level without a competitive advantage. This coaching conversation will help mid- and early-career participants learn new Agile and OKR (objectives and key results)-based skills that will provide them with a competitive advantage and increase their chances of being continuously employable.", "name": "Boost Your Career with Agile Skills and OKRs", "type": "Session"}, "275": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:15 AM", "start_ET": "01:45 PM", "end_ET": "02:15 PM"}, "categories": ["Virtual, Augmented, and Mixed Reality", "Beginner"], "speakerIds": [467, 112], "description": "The amount of high-quality data collected at sporting events increases in tandem with the potential for generating media that is both statistically and visually compelling. Join us as we introduce a workflow we developed with the Unreal engine that uses live data both to create visualizations for broadcast in real-time, and to develop an XR experience that dynamically engages fans with the data.", "name": "Taking a Swing at Realtime Rendering: Baseball, Live Data, and Mixing Realities", "type": "Session"}, "276": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": ["Security/Privacy", "Senior Career"], "speakerIds": [277, 164, 109, 230], "description": "An exciting panel of diverse female CIOs will share what it takes to make the leap into the executive ranks. They are eager to share insights into what it takes to grow and thrive after entering the C-Suite and explore the challenges once there. They will include insight into the WFH challenges that developed with the COVID-19 pandemic. They are also enthusiastic to discuss emerging technology.", "name": "You Too! Becoming an Influential Female CIO", "type": "Session"}, "277": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [106], "description": "When someone is ambitiously navigating their career, they inevitably deal with a certain level of stress and demand on their time as they are surrounded by a swirling sea of 24/7 connectivity. How can we protect ourselves from drowning in the turbulent waters of stress and anxiety? In this session, participants will learn tips & techniques to help create a more balanced work-life to thrive.", "name": "Do Not Burn The Boats: Finding balance and mindful strategies to avoid work stress  and burn out", "type": "Session"}, "278": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [118, 255], "description": "The compensation package of your first job after graduation is the foundation of your earning power for the rest of your career. In this mentoring session, we will teach you how to evaluate all of the financial components of your offer and give you feedback on where your offer stands in comparison to other offers in the market from the same company and similarly tiered companies.", "name": "Deal or No Deal:  Is Your New Grad Compensation Package a Good Offer?", "type": "Session"}, "279": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [84, 120], "description": "At the workplace, learning to say \"no\" is just as important as saying \"yes.\" Recent events have reshaped the way we work and live, but the art of saying no with confidence and grace is more important than ever. This session will share tips on making good choices and setting boundaries that will lead to valuable experiences, learning opportunities, and fulfillment on professional & personal levels.", "name": "No Is Your Superpower", "type": "Session"}, "280": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [197], "description": "Equally excited about neural networks and go to market strategies? Looking to start or transition into a product management role that uses artificial intelligence and machine learning technologies? This dialog will provide early and mid-career attendees advice for careers in AI product management. Mentor will discuss essential skills and tips to be successful at companies large and small.", "name": "Careers in AI Product Management", "type": "Session"}, "281": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [271], "description": "Many people graduate with technical degrees but have little to no understanding of what soft skills are and how they go about developing them. In this session, participants will learn the importance of building and leveraging personal networks, diplomacy, problem-solving, and a host of other skills. We'll also discuss how you can increase your marketability by improving your soft skills.", "name": "Enhancing Your Career, Tech Skills Aren't Enough - Soft Skills Required", "type": "Session"}, "282": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [296, 239], "description": "That critical first job search can be truly overwhelming, particularly with the impact of COVID-19. This dialog will center on strategies for defining and refining personal priorities for women in the current tech ecosystem and using them to drive your job search with a laser sharp focus. Attendees will receive guidance and practical, step-by-step approaches for identifying their ideal position.", "name": "Reduce() Your Job Search Complexity: The Secret to Practical Priorities", "type": "Session"}, "283": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [461], "description": "\"Great Expectations\" is what most of us have from our very first job. The Covid-19 pandemic has forced many to work remotely, posing an elevated challenge to those starting their first job. How can we accurately set our expectations and avoid surprises at the start of our career? This talk has tips & techniques for being effective & successful at a new workplace amidst the current situation.", "name": "The First Job Conundrum in 2020", "type": "Session"}, "284": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [127, 149], "description": "Searching for that perfect job is like finding your way out of an escape room, especially during a pandemic. You need to use the right clues to solve the puzzle. If you do this with a team to help you, you will solve it faster. In this escape room challenge, you will learn how to identify those meaningful clues and construct a team that will lead you to solve this career puzzle.", "name": "Escape Room Your Way to Your Perfect Career", "type": "Session"}, "285": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [189], "description": "Navigating a career in IT can be a challenge as a woman especially during uncertainty. This discussion will focus on how to take charge of your career, make the most of your current role, and pivot to get the experiences you need to move through your career journey and up the success ladder. It will explore how to effectively leverage mentors, coaches, and sponsors to assist you.", "name": "YOU are the Secret to your Success!", "type": "Session"}, "286": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [288, 390], "description": "As college students, we often receive guidance on how to apply for jobs, fellowships, and graduate programs after graduation - yet we get very little advice or information about what post-graduate life will actually be like. In this discussion, two graduates from 2017 share insights on living in the \"real\" world, with a particular focus on finding stability and success in the face of change.", "name": "How to Adult: Professional, Social, & Financial Success in Post-Graduate Life", "type": "Session"}, "287": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [140, 99], "description": "How do you prepare for the next career move? Even in the current pandemic, this reality can potentially create more momentum toward making a big move. The presenters will discuss approaches to career transitions while drawing parallels to their own experiences. Both of them come from the same engineering class, while one specialized in a different engineering domain, another in product management.", "name": "How To Embrace Change In Your Career?", "type": "Session"}, "288": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [151, 393], "description": "Smart people surround themselves with even smarter people. Yet working effectively with the smartest comes with challenges and can be overwhelming initially. Doing it virtually adds to it. In this interactive session you will learn how to identify and deal wisely with the challenges and channel your energy on maximizing the key benefit: improving your craft!", "name": "Be Wise, When Everyone Around You Is Smart And Virtual", "type": "Session"}, "289": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [356], "description": "Behavioral interview is a very popular interview technique used by most tech companies including Amazon, FB, Google etc. Nailing these questions could help you set yourself apart, especially during remote interviews and current hiring slowdown. Join this mentoring circle for personalized practice and advice on your interview answers. Leave the session lot more confident of nailing your dream job.", "name": "Nail Your Behavioral Interviews!", "type": "Session"}, "290": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [87, 89], "description": "Fear of taking risks can lead us to become complacent in our professional careers. Given the speed that technology is revolutionizing the world, women of all races and ethnicities must be ready to embrace change and take risks in STEM. This session is aimed at engaging in a discussion around developing a mindset to ignore the fear of failure, take risks, and aim to choose bravery over perfection.", "name": "The Tech Revolution: Be Brave Not Perfect by Taking Risks in STEM", "type": "Session"}, "291": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": ["Open Source", "Beginner"], "speakerIds": [62, 391], "description": "Are you curious about how a reliable, real-life messaging system works? Apache Kafka, the open-source distributed streaming platform, is widely used in industry - at Bloomberg, LinkedIn, Netflix, and Twitter, to name a few. In this workshop, we will go over the basics of what Kafka is and how to use it through a hands-on activity in which you get to network and make new friends while using Kafka.", "name": "Getting Friendly with Kafka: An Introduction to Apache Kafka & lifelong connections", "type": "Session"}, "292": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:15 AM", "start_ET": "01:45 PM", "end_ET": "02:15 PM"}, "categories": ["Software Engineering", "Advanced"], "speakerIds": [384, 24], "description": "Running Microservices has become the standard because of its many benefits, such as scalability, simplicity, and maintainability. However, it also adds complexity to managing networks and securing service-to-service communication. Join us to learn how a service mesh can automate service-to-service networking, why you might need one, and how to untangle a service mess with a Service Mesh!", "name": "Untangling a Service Mess With a Service Mesh", "type": "Session"}, "293": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "10:45 AM", "end_PT": "11:45 AM", "start_ET": "01:45 PM", "end_ET": "02:45 PM"}, "categories": [], "speakerIds": [396, 351], "description": "Are you a software engineer looking to go above and beyond your defined role? By thinking like a product manager, designer and data scientist, you can become not just a product builder, but a product owner. We will discuss the skills you can borrow from these domains, including how to adapt them to todayís COVID-19 reality, in which learning from customers must be done differently.", "name": "From Just Building It to Owning It", "type": "Session"}, "294": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "11:15 AM", "end_PT": "11:45 AM", "start_ET": "02:15 PM", "end_ET": "02:45 PM"}, "categories": ["Artificial Intelligence", "Beginner"], "speakerIds": [144], "description": "Today's artificial neural networks (ANNs), though bio-inspired, are more abstract representations of biological brains. Spiking neural networks (SNNs) take a step in the direction of biological realism.  In this talk, an introduction to SNNs will be given, including how they relate to neuroscience, how theyíre different from ANNs, and why they're important to the future of machine learning.", "name": "Spiking Neural Networks: Bridging the Gap from Neural Networks to Neuroscience", "type": "Session"}, "295": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "11:15 AM", "end_PT": "11:45 AM", "start_ET": "02:15 PM", "end_ET": "02:45 PM"}, "categories": ["Software Engineering", "Intermediate"], "speakerIds": [427], "description": "Gone are the days when we manually manage infrastructure - especially in these times of COVID-19. Today we need the ability to click a few buttons to reconfigure servers, efficiently but remotely. Infrastructure as code (IaC) empowers us to manage and provision infrastructure through code automatically, quickly, and error-free. Come learn the benefits, challenges, and practices of IaC.", "name": "Infrastructure as Code: Equip Yourself for the Changing World", "type": "Session"}, "296": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "11:15 AM", "end_PT": "11:45 AM", "start_ET": "02:15 PM", "end_ET": "02:45 PM"}, "categories": ["Career", "All"], "speakerIds": [319, 61], "description": "Organizational productivity is hampered when bullying behavior in the workplace is ignored. It's critical to diagnose, analyze and eliminate such behaviors. Remote work due to COVID-19 has introduced new challenges that complicate diagnosis and remediation. If you have ever felt vulnerable or have witnessed non-inclusive behavior and wanted to do something about it, this session is for you.", "name": "Dealing with Workplace Bullies", "type": "Session"}, "297": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "11:15 AM", "end_PT": "11:45 AM", "start_ET": "02:15 PM", "end_ET": "02:45 PM"}, "categories": ["Virtual, Augmented, and Mixed Reality", "Intermediate"], "speakerIds": [247], "description": "The COVID-19 pandemic has shown us that we need to fundamentally redesign our approach to training and development in both education and workplace. Our overwhelming dependency on face-to-face or in-person instruction system and work environment is not sustainable forever. More importantly, this factor has disproportionately more negative impact on women and people of color.", "name": "Addressing Inequality through Reshaping the Post-Pandemic Training and Workplace", "type": "Session"}, "298": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "11:15 AM", "end_PT": "11:45 AM", "start_ET": "02:15 PM", "end_ET": "02:45 PM"}, "categories": ["Diversity, Equity and Inclusion", "Senior/Executive"], "speakerIds": [172], "description": "Lack of women and minority representation in executive leadership leads to an imbalanced structure. Businesses are challenged to transform their current mindsets and diversify the demographics of top executive layers through inclusive leadership growth strategies. Businesses face obstacles that should be identified and removed to provide a thriving culture for all underrepresented members.", "name": "Diversity Best Practices: Advancing Underrepresented Leaders", "type": "Session"}, "299": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "11:15 AM", "end_PT": "11:45 AM", "start_ET": "02:15 PM", "end_ET": "02:45 PM"}, "categories": ["Hardware", "Intermediate"], "speakerIds": [430], "description": "Concerning 3D printing advancement nowadays, the main concern is the inconsistency of the geometrical dimension. This proposal is a solution by providing a real-time monitoring desktop GUI to check the geometrical discrepancy of 3D-printed structures considering the impact of COVID-19 on its progress. The proposed software saves manufacturing time and improves the quality of 3D-printed structures.", "name": "Impact of COVID-19 in the Enhancement of Evaluating 3D printed Structures on Real-Time", "type": "Session"}, "300": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "11:50 AM", "end_PT": "12:50 PM", "start_ET": "02:50 PM", "end_ET": "03:50 PM"}, "categories": ["Entrepreneurship", "Intermediate"], "speakerIds": [295, 286], "description": "In this world of start-ups and entrepreneurship, the #1 reason for failure is \"failing to offer a product or service the market wants.\" In this workshop you will practice \"getting-to-empathy\" methods you can use in today's COVID-19 reality of remote communication, that will ensure you have identified a big important problem to solve - from a customer point of view. It all begins with EMPATHY.", "name": "It All Begins With EMPATHY", "type": "Session"}, "301": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "11:50 AM", "end_PT": "12:20 PM", "start_ET": "02:50 PM", "end_ET": "03:20 PM"}, "categories": ["Virtual, Augmented, and Mixed Reality", "Intermediate"], "speakerIds": [332, 25], "description": "Augmented Reality is currently a big technology trend. It is used in AR Quick Look to let users see a 3D item, embedded in a website or app, in their environment. Learn how scene understanding algorithms empower this experience for millions of iOS users. Join our talk to hear more about developing algorithms for Apple's ARKit, and the accompanied everyday challenges and opportunities it provides.", "name": "Challenges in Developing Machine Learning Algorithms for Mobile Augmented Reality", "type": "Session"}, "302": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "11:50 AM", "end_PT": "12:50 PM", "start_ET": "02:50 PM", "end_ET": "03:50 PM"}, "categories": ["Software Engineering", "All"], "speakerIds": [342, 449, 292], "description": "How can you showcase your job experiences and skills? This workshop will help you start coding a technical portfolio in Markdown and deploy it with Github Actions. You’ll leave with a live website for others to see! Bring your laptop and a Github handle to learn how to build a portfolio as code and practice continuous integration and delivery.", "name": "Code & Deploy Your Technical Portfolio", "type": "Session"}, "303": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "11:50 AM", "end_PT": "12:20 PM", "start_ET": "02:50 PM", "end_ET": "03:20 PM"}, "categories": ["Virtual, Augmented, and Mixed Reality", "#N/A"], "speakerIds": [195], "description": "This talk describes how edge computing, the distribution of computing resources away from datacenters and closer to the end users, can be used to enable next-generation augmented reality (AR). The talk presents an overview of edge computing, and describes two edge-based AR solutions we recently developed: edge-based holographic content provisioning and edge-based collaborative image recognition.", "name": "Edge Computing-Supported Mobile Augmented Reality", "type": "Session"}, "304": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "11:50 AM", "end_PT": "12:20 PM", "start_ET": "02:50 PM", "end_ET": "03:20 PM"}, "categories": ["Artificial Intelligence", "Advanced"], "speakerIds": [401, 240], "description": "We address the problem of generating recommendations for completing the outfit. The proposed method is based on a siamese network used for feature extraction followed by a fully-connected network used for learning a compatibility metric. The siamese embeddings are augmented with color histogram features. The training of the network is formulated as a maximum a posteriori problem.", "name": "Shop the Look: Fashion Compatibility Prediction for Complementary Product Recommendation", "type": "Session"}, "305": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "11:50 AM", "end_PT": "12:20 PM", "start_ET": "02:50 PM", "end_ET": "03:20 PM"}, "categories": ["Open Source", "Intermediate"], "speakerIds": [210], "description": "Monitoring and retrieving history data in Kubernetes is challenging, when a resource is terminated its corresponding logs will disappear. Existing tools either lack functionality or they are expensive making them unaffordable in the current economic environment. How can we develop a free tool that helps users get Kubernetes history data? This is the inspiration for our open source project: Sloop.", "name": "Sloop: the Journey from Hackathon Idea to Open Source Project", "type": "Session"}, "306": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "11:50 AM", "end_PT": "12:50 PM", "start_ET": "02:50 PM", "end_ET": "03:50 PM"}, "categories": ["All"], "speakerIds": [], "description": "Anita|Bees Speed Mentoring will feature groups of 6 mentees:1 mentor. The event will still feature several 15-minute rounds in which attendees are matched with industry professionals, academic professionals, and successful graduate students by career level and area of interest that follow the defined GHC Tracks.", "name": "Speed Mentoring", "type": "Session"}, "307": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "11:50 AM", "end_PT": "12:50 PM", "start_ET": "02:50 PM", "end_ET": "03:50 PM"}, "categories": ["Career", "Mid-Career"], "speakerIds": [354, 28, 59, 330, 259], "description": "To sail successfully you need a crew working together towards a greater purpose. Covid is illuminating several truths about how important our relationships are. Building authentic relationships in this socially distant world requires us to put in a conscious effort. Join us to learn about why relationships matter, how to be an ally in the present day, and create a personal crew of support.", "name": "#Relationships Are The True Currency: Create Your Personal Crew of Support", "type": "Session"}, "308": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "11:50 AM", "end_PT": "12:50 PM", "start_ET": "02:50 PM", "end_ET": "03:50 PM"}, "categories": ["Academic Track", "All"], "speakerIds": [45, 313, 11, 368], "description": "Change is inevitable in this world as organizations increasingly embrace the agile mindset as the daily norm. The extent of change is greatly amplified during the unprecedented times caused by COVID-19. We will explore how leaders in various roles with diverse backgrounds embrace the change mindset regardless of euphoric highs and challenging lows and in turn build out successful careers.", "name": "Embracing Change Mindset For Career Advancement Amid COVID-19, Reorg And Economic Hardship", "type": "Session"}, "309": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "12:20 PM", "end_PT": "12:50 PM", "start_ET": "03:20 PM", "end_ET": "03:50 PM"}, "categories": ["All"], "speakerIds": [], "description": "Promote and support women of color in technical roles from industry, government, and academia. This program, developed in partnership with CMD-IT and Underrepresented Women in Computing, focuses on raising awareness about the intersectionality of gender and race/culture. The audience includes: Black/African American, Hispanic/Latina, Native American, Native Hawaiian, Pacific Islander, and Asian.", "name": "Luncheon Celebrating Women of Color in Technical Roles", "type": "Session"}, "310": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "12:20 PM", "end_PT": "12:50 PM", "start_ET": "03:20 PM", "end_ET": "03:50 PM"}, "categories": ["Diversity, Equity and Inclusion", "All"], "speakerIds": [474], "description": "In a world that is constantly evolving, how can our global Diversity, Equity & Inclusion strategy keep up? It's time to approach DEI as we approach the evolution of technology; as a journey, and not a destination. This session will shift the mindset of DEI to embrace the journey we must take to achieve permanent and renewable solutions for substantial growth in our workplace!", "name": "Disrupt D&I: How to Show up, Fix Flaws and Create Real Change", "type": "Session"}, "311": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "12:20 PM", "end_PT": "12:50 PM", "start_ET": "03:20 PM", "end_ET": "03:50 PM"}, "categories": ["Open Source", "Intermediate"], "speakerIds": [335, 488], "description": "Authorization is a challenge in Identity & Access Management, for business or consumer use cases. Just debating attribute vs. role-based access will give you a headache and not to mention policy points: decision, enforcement, information. We will share how our globally distributed team decided to use an open source for AuthZ, while testing assumptions how open the open source communities are.", "name": "Using Open Source to Solve Customer Identity Authorization", "type": "Session"}, "312": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "12:20 PM", "end_PT": "12:50 PM", "start_ET": "03:20 PM", "end_ET": "03:50 PM"}, "categories": ["Diversity, Equity and Inclusion", "All"], "speakerIds": [57], "description": "The responsibility of any DEI professional is educating organizations more broadly about a simple truth - we all the responsibility to help drive DEI for change in the workplace. Shareka L. Nelson, Director of Diversity, Equity, & Inclusion at Mailchimp, will explore philosophies and tactics around corporate diversity and inclusion; sharing best practices and actionable  steps for individuals.", "name": "Diversity, Equity, and Inclusion for the Non-DEI Professional", "type": "Session"}, "313": {"date": {"start_date": "10/02/20", "end_date": "10/02/20", "start_PT": "01:30 PM", "end_PT": "02:30 PM", "start_ET": "04:30 PM", "end_ET": "05:30 PM"}, "categories": ["All"], "speakerIds": [], "description": "", "name": "GHC Evening Celebration", "type": "Session"}, "314": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "08:00 AM", "end_PT": "09:00 AM", "start_ET": "11:00 AM", "end_ET": "12:00 PM"}, "categories": ["Artificial Intelligence", "Mid-Career"], "speakerIds": [76, 163, 358, 436, 55], "description": "Do you work in academia and have an idea for an AI initiative that you want to accelerate with an industry partner? How do you take an idea for curriculum, research or new product development and partner with industry post COVID-19 to make it happen? Join us to hear from diverse university and industry thought leaders about successful approaches to develop and maintain impactful AI partnerships.", "name": "Catalyzing AI Innovation Responsibly through Academia-Industry Collaboration", "type": "Session"}, "315": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "08:00 AM", "end_PT": "09:00 AM", "start_ET": "11:00 AM", "end_ET": "12:00 PM"}, "categories": ["Product Management", "Intermediate"], "speakerIds": [422, 58, 220, 74, 229], "description": "Data, this building block of the digital economy, is a double-edge sword contributing to both customer delight and trust damage, both inclusion & exclusion. This panel discusses controversial topics in privacy, bias, governance & accountability, elaborating on implications in social and economical gaps, tradeoffs of contact-tracing in public health and potential extension to political suppression.", "name": "Data Ethics and Privacy: The Pivotal Issues of the Next Decade", "type": "Session"}, "316": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "08:00 AM", "end_PT": "08:30 AM", "start_ET": "11:00 AM", "end_ET": "11:30 AM"}, "categories": ["Data Science", "Beginner"], "speakerIds": [113, 15], "description": "When preparing for new vehicle production, Ford engineers undertake a complex planning process to determine the allocation of ~10,000 work steps, associated parts and tools to stations and operators. This project delivers AI based optimized allocation of labor, tools, and parts to workstations. The targeted savings are ~$1.5M per plant and an additional $1M in annual cost avoidance in NA.", "name": "AI Based Allocation to Optimize Cycle Line Layout for Automotive Manufacturing", "type": "Session"}, "317": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "08:00 AM", "end_PT": "08:30 AM", "start_ET": "11:00 AM", "end_ET": "11:30 AM"}, "categories": ["Career", "Early Career"], "speakerIds": [441], "description": "When deciding on next steps in your career, you should consider moves that are outside your current area of work (lateral move) and not just those in your current area of work (vertical move). Lateral moves broaden our perspective, expand our network and increase our confidence. We become well rounded professionals and put ourselves in a better position for leading and making an impact.", "name": "Career Moves - Changing and taking chances", "type": "Session"}, "318": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "08:00 AM", "end_PT": "08:30 AM", "start_ET": "11:00 AM", "end_ET": "11:30 AM"}, "categories": ["Software Engineering", "#N/A"], "speakerIds": [395], "description": "Five Nines or 99.999% has become the popular availability goal for services.  Putting into perspective, that's about 5 minutes or less of service downtime a year. Given the complex intertwined micro-services world we operate in today, how do you go about designing for high availability? In this session, we will discuss some best practices that can push your service towards maximizing its uptime.", "name": "The Law of Nines: Designing your Service for High Availability", "type": "Session"}, "319": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "08:30 AM", "end_PT": "09:00 AM", "start_ET": "11:30 AM", "end_ET": "12:00 PM"}, "categories": ["Software Engineering", "#N/A"], "speakerIds": [228, 165], "description": "Millions of customers flock to Audible, the world's largest seller & producer of audiobooks, during Christmas. We'll share the industry experience of running load tests to handle extra load in distributed environments, from defining target load and executing the tests in a production environment, to analyzing generated results; and adapting the process to COVID-19 pandemic related traffic changes.", "name": "Prepping for Christmas: Lessons Learned From Load Testing Distributed System", "type": "Session"}, "320": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "08:30 AM", "end_PT": "09:00 AM", "start_ET": "11:30 AM", "end_ET": "12:00 PM"}, "categories": ["Data Science", "Beginner"], "speakerIds": [43], "description": "In my talk, I will showcase three large-scale data-driven studies from my research to illustrate that increasing the number of women themselves will not debug the gender gap. On examples from open source software engineering, video game development, and scientific collaborations I will describe why we should not focus only on diversity.", "name": "Why Diversity is Not Enough?", "type": "Session"}, "321": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "08:30 AM", "end_PT": "09:00 AM", "start_ET": "11:30 AM", "end_ET": "12:00 PM"}, "categories": ["Career", "#N/A"], "speakerIds": [373], "description": "How do you find a job in tech when AI is \"hiring\"? How can employers keep up with hiring demands? How can AI overcome rather than amplify bias? This conversation will shed light on how radically the job search has changed and how AI is changing HR. Understand the perils and potential of these new job search technologies, how to prepare, and how to build equitable workforces that innovate for all.", "name": "Hiring and Finding a Job in Tech: Your Guide to a Radically Evolving AI Landscape", "type": "Session"}, "322": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "09:00 AM", "end_PT": "09:30 AM", "start_ET": "12:00 PM", "end_ET": "12:30 PM"}, "categories": ["Academic Track", "All"], "speakerIds": [85], "description": "The impact of biased technology on marginalized groups has gained increasing attention. However, these biases, their impact, and how a lack of diversity, equity, and inclusion (DEI) in computing lead to them are rarely discussed in university computing curricula. This presentation discusses cultural competence and why it should become a required topic throughout computing departments nationwide.", "name": "We're Not Fixing It: Why Every Computing Department Needs Cultural Competence Courses", "type": "Session"}, "323": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "09:00 AM", "end_PT": "10:00 AM", "start_ET": "12:00 PM", "end_ET": "01:00 PM"}, "categories": ["Career", "Students"], "speakerIds": [242, 267], "description": "Set yourself up for career success by visualizing where you want to be in 5-years and creating an action plan to get there! Whether you are apprehensive about starting your career or excited to plan out the next step, we can help! Youíll leave with a virtual vision board full of inspiration, actionable tips, and your individualized 5-year career roadmap.", "name": "Make Your Visions Come True: Creating Your 5-Year Career Virtual Vision Board", "type": "Session"}, "324": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "09:00 AM", "end_PT": "10:00 AM", "start_ET": "12:00 PM", "end_ET": "01:00 PM"}, "categories": ["Hardware", "Intermediate"], "speakerIds": [27, 95, 252, 344, 268], "description": "Data science benefits from large and diverse sets of interlinked data. However, people increasingly view this benefit as a detriment to individual privacy. This panel critically analyzes the state of privacy today, including considerations relating to COVID-19 and explores strategies that companies can employ to maintain high quality analytics while protecting a fundamental human right.", "name": "Walking a tightrope: Privacy vs Data Science", "type": "Session"}, "325": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "09:00 AM", "end_PT": "09:30 AM", "start_ET": "12:00 PM", "end_ET": "12:30 PM"}, "categories": ["Software Engineering", "Intermediate"], "speakerIds": [308, 104], "description": "Bloomberg democratizes access to financial data. Billions of enterprise client activities occur every day. With a self-service platform to monitor events and get alerts about anomalies, our clients can use our products confidently, especially during this time of unprecedented market volatility. Learn how we've used open source technologies to build a highly reliable, low-latency platform.", "name": "Building a Scalable Real-Time Monitoring and Analytics Platform for Large Enterprises", "type": "Session"}, "326": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "09:30 AM", "end_PT": "10:00 AM", "start_ET": "12:30 PM", "end_ET": "01:00 PM"}, "categories": ["Software Engineering", "Intermediate"], "speakerIds": [82, 108], "description": "Online media service is crucial in COVID19 pandemic era and Netflix's Cosmos platform is up to the challenges. With serverless computing, multi-tenant rule engine, GRPC based microservices and priority low latency queue, Cosmos shapes Netflix's next generation cloud scale media processing. Join Cosmos engineers to see the technical designs, challenges overcome and accomplishments of the system.", "name": "Cosmos: Microservice based Media Processing Architecture", "type": "Session"}, "327": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "09:30 AM", "end_PT": "10:30 AM", "start_ET": "12:30 PM", "end_ET": "01:30 PM"}, "categories": ["Computer Systems Engineering", "Beginner"], "speakerIds": [283, 26, 325, 372], "description": "<div class=\"ag87-crtemvc-hsbk\"><div class=css-zuif4x><p class=\"carina-rte-public-DraftStyleDefault-block\"><span style=\"color: rgb(0,0,0);\">How do you find your first users? How do you interview users and get reliable, unbiased feedback on your product or service? Hear tips from three founders/CEO’s who are building or have built in the consumer, b2b and enterprise space - Holly Liu (Kabam), Tracy Young (PlanGrid) and Iba Masood (Tara.ai). The panel will be moderated by Y Combinator partner Kat Manalac.</span></p></div></div>", "name": "How to Talk to Users?", "type": "Session"}, "328": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "10:00 AM", "end_PT": "11:00 AM", "start_ET": "01:00 PM", "end_ET": "02:00 PM"}, "categories": ["Academic Track", "Early Career"], "speakerIds": [110, 323, 402], "description": "Junior faculty often face issues beyond technical challenges for which they are poorly prepared, disproportionately affecting underrepresented groups. Mentoring can be a significant mitigator but is frequently lacking. This, coupled with a lack of senior underrepresented faculty, can be disastrous. We use storytelling to bring light to potential challenges and offer guidance and build resiliance.", "name": "The Academic Life: A Faculty Development Workshop", "type": "Session"}, "329": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "10:00 AM", "end_PT": "11:00 AM", "start_ET": "01:00 PM", "end_ET": "02:00 PM"}, "categories": ["Career", "Students"], "speakerIds": [160, 226], "description": "Students are always told to \"get an internship\", but no one really shows them how. In this session, you'll learn how to set yourself up for success throughout the application process, including: \"How to find an internship during any college year.\" How to make a plan apply to and interview with companiesï The secrets to successful interviewing", "name": "Cracking the Internship Code:  A Crash Course on How to Get an Internship in Tech", "type": "Session"}, "330": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "10:00 AM", "end_PT": "10:30 AM", "start_ET": "01:00 PM", "end_ET": "01:30 PM"}, "categories": ["Security/Privacy", "Beginner"], "speakerIds": [451], "description": "Technology helps us remember what we've done and where we've been on our computers + smart phones. For any user, understanding what information gets left behind due to normal device use helps us understand security + privacy implications of those technologies. This talk will introduce attendees at any technical level to think like a forensic (DFIR) examiner to understand your data breadcrumbs.", "name": "Digital Forensic Breadcrumbs", "type": "Session"}, "331": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "10:00 AM", "end_PT": "10:30 AM", "start_ET": "01:00 PM", "end_ET": "01:30 PM"}, "categories": ["Career", "All"], "speakerIds": [281, 6], "description": "A developer advocate is a bridge between engineering teams at a company and its users. Their goal is to draw in and support users by being technically knowledgeable about products, sharing experiences, as well as being the source to give direct feedback to the product teams.  We are here to get rid of misconceptions and cover the skills it takes to be an effective developer advocate!", "name": "Adapt, Grow, and Pollinate: The Journey to Becoming an Effective Developer Advocate", "type": "Session"}, "332": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "10:00 AM", "end_PT": "11:00 AM", "start_ET": "01:00 PM", "end_ET": "02:00 PM"}, "categories": ["Data Science", "Intermediate"], "speakerIds": [424, 250, 36, 88, 101], "description": "Platformization is a popular topic in the tech industry. But what is it, how does it apply to me, and how does it work? And practically, how do I know if my product should transform to a platform? How can it help us better serve users in rapidly changing times? We will address these questions from a wide range of viewpoints, from product to engineering and from enterprise to consumer companies.", "name": "Making the Leap From Product to Platform", "type": "Session"}, "333": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "10:30 AM", "end_PT": "11:00 AM", "start_ET": "01:30 PM", "end_ET": "02:00 PM"}, "categories": ["Data Science", "Intermediate"], "speakerIds": [452, 307], "description": "The flow of API traffic provides a rich source of information that could be used to find problems and debug performance issues. We describe a Bayesian automated anomaly detection system to alert users about unusual patterns in API traffic data. The anomaly detection process was used during the first few weeks of the Covid lockdown when dramatic changes in traffic patterns required rapid responses.", "name": "Anomaly Detection for API Traffic", "type": "Session"}, "334": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "10:30 AM", "end_PT": "11:00 AM", "start_ET": "01:30 PM", "end_ET": "02:00 PM"}, "categories": ["Security/Privacy", "Beginner"], "speakerIds": [456], "description": "Escalating demand for digital services has motivated building non-traditional service solutions, such as peer-assisted models. Cryptocurrencies have strengthened this trend by providing a fully distributed mechanism to reward for the service. We present a generic framework for building distributed service markets, and discuss the security and efficiency challenges along with potential solutions.", "name": "Rethinking Service Systems: A Path Towards Secure and Equitable Resource Markets", "type": "Session"}, "335": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "10:30 AM", "end_PT": "11:00 AM", "start_ET": "01:30 PM", "end_ET": "02:00 PM"}, "categories": ["Career", "All"], "speakerIds": [446], "description": "Cognitive scientist Sian Beilock will explain why skilled women so often succumb to stereotype-driven expectations, and how fewer minorities in a field deters future generations from pursuing a place at the table. Beilock will also provide advice and specific cognitive tools that women with intersecting identities across career stages can employ to beat negative stereotypes and achieve success.", "name": "Stereotype Threat and Choking Under Pressure: Why It Happens and How We Can Stop It.", "type": "Session"}, "336": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "11:00 AM", "end_PT": "12:00 PM", "start_ET": "02:00 PM", "end_ET": "03:00 PM"}, "categories": ["Tech for Women", "All"], "speakerIds": [473, 126, 178, 42, 191], "description": "Women, people of color, and low-income individuals are greatly underrepresented among patent applicants and holders. These lower participation rates in the innovation economy have significant consequences for individuals, families, and the broader economy. Invent Together will explore these gaps, their consequences, and the role we all play in closing them.", "name": "Invent Together: Closing Gaps in the Patenting and Commercialization of Inventions", "type": "Session"}, "337": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "11:00 AM", "end_PT": "12:00 PM", "start_ET": "02:00 PM", "end_ET": "03:00 PM"}, "categories": ["Career", "Students"], "speakerIds": [174, 114], "description": "The technical whiteboard interview is a common practice in the hiring process by many technology companies. Interviewees often fear the whiteboard interview and do not perform to their full potential, especially now where many interviews are being conducted remotely. This workshop provides an organized approach to help job seekers tackle any whiteboard question and work through it with confidence.", "name": "Tackling the Technical Whiteboard Interview: An Organized Approach", "type": "Session"}, "338": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "11:00 AM", "end_PT": "11:30 AM", "start_ET": "02:00 PM", "end_ET": "02:30 PM"}, "categories": ["Data Science", "Intermediate"], "speakerIds": [47], "description": "A neural network trained over a transaction graph embeds the collaborative signal of customers in common between merchants. The resulting embeddings allow efficient computations which enable entity resolution of online merchants, providing new ways to fight fraud. As the spread of COVID-19 shifts more commerce online, new challenges emerge in fraud and the use of embeddings.", "name": "Fighting Fraud in Digital Commerce: A Financial Transaction Embedding Use Case", "type": "Session"}, "339": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "11:00 AM", "end_PT": "11:30 AM", "start_ET": "02:00 PM", "end_ET": "02:30 PM"}, "categories": ["Software Engineering", "Intermediate"], "speakerIds": [128], "description": "At Affirm, engineering growth has put tremendous pressure on our build system. In this presentation, we dig into our year-long battle with getting our build/test systems to scale with our growth. The new system not only supports six times the load, but also reduces 66% of build instability, and shaves build duration from 20-70 min down to 2-14 min.", "name": "Scaling Affirm's Build Infrastructure - A Tale of two CI Systems", "type": "Session"}, "340": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "11:00 AM", "end_PT": "11:30 AM", "start_ET": "02:00 PM", "end_ET": "02:30 PM"}, "categories": ["Security/Privacy", "Beginner"], "speakerIds": [445], "description": "It's easy now to create a person who never existed. To give her a voice. And a history. Even to then create videos of her. What is the technology behind this? Known as deepfakes, most media portrayals of the technology talk about how it can be misused. But is there a need to panic? What can companies, and even individuals, do to protect themselves?", "name": "Deepfakes: Do they Spell Deep Trouble?", "type": "Session"}, "341": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "11:30 AM", "end_PT": "12:00 PM", "start_ET": "02:30 PM", "end_ET": "03:00 PM"}, "categories": ["Security/Privacy", "Beginner"], "speakerIds": [476], "description": "Most COVID-19 containment strategies require tracking and identifying people who may have interacted with an infected person, which escalates tensions between personal privacy and the common good. This tension is even worse for marginalized groups. This talk introduces and surveys the unequal privacy cost to marginalized groups, especially during the pandemic, and what we should do to help.", "name": "Another Invisible Threat: Unequal Privacy Cost of Tracing COVID-19", "type": "Session"}, "342": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "11:30 AM", "end_PT": "12:00 PM", "start_ET": "02:30 PM", "end_ET": "03:00 PM"}, "categories": ["Software Engineering", "Intermediate"], "speakerIds": [218, 316], "description": "Modern software development is placing increasingly high demands on software testing. Not only is the software under test more complex (distributed and ML components), but the demand for instantaneous releases requires processes to be extremely efficient. In this talk, we outline new challenges faced by our team at Apple and provide a deep dive into the innovative techniques used to address them.", "name": "Software Testing — Emerging Challenges in Industry", "type": "Session"}, "343": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "11:30 AM", "end_PT": "12:00 PM", "start_ET": "02:30 PM", "end_ET": "03:00 PM"}, "categories": ["Data Science", "Advanced"], "speakerIds": [227], "description": "Trillions of realtime events are available at most orgs, but the problem of processing high throughput data in a low latency manner still remains. Furthermore, building easy to use solutions at scale is a challenge. Join me in learning how we built a self-service, fully managed platform to run complex aggregations on streaming data for applications ranging from ML to event driven programming.", "name": "How to Build A Fully Managed Stream Processing Platform and Live to Tell The Tale", "type": "Session"}, "344": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "12:00 PM", "end_PT": "01:00 PM", "start_ET": "03:00 PM", "end_ET": "04:00 PM"}, "categories": ["Career", "All"], "speakerIds": [331, 485, 79, 382], "description": "Startups have all the fun, or at least that's what's commonly said in the media. Working with large government agencies, I take great exception to this notion. To back me up, this panel invites 3 females techies from across several government agencies to reflect on the fun times and rewarding challenges they've found in their careers.", "name": "Do Startups Have All the Fun? Secrets of Remarkable Careers in Public Service", "type": "Session"}, "345": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "12:00 PM", "end_PT": "12:30 PM", "start_ET": "03:00 PM", "end_ET": "03:30 PM"}, "categories": ["Data Science", "Beginner"], "speakerIds": [258, 290], "description": "At Nordstrom, our goal is to provide our customers with the best experience regardless of how they choose to shop with us. Whether it's at one of our stores or on Nordstrom.com, we strive to provide them with a personalized experience. We're using modern computer vision and streaming analytics to better understand customer behavior, which is especially important in a post-COVID-19 economy.", "name": "Customer Insights: Leveraging Computer Vision and Edge Computing", "type": "Session"}, "346": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "12:00 PM", "end_PT": "01:00 PM", "start_ET": "03:00 PM", "end_ET": "04:00 PM"}, "categories": ["Software Engineering", "Intermediate"], "speakerIds": [245, 150, 433], "description": "Are you interested in building distributed systems with real time stream processing capability and reliably scale up to billions of events? Distributed message queues are the fundamental pillar for modern microservice architectures, and played an important role in supporting many COVID campaigns. Come get your first-hand experience on message queue, and build a mini pick up service with Kafka.", "name": "Distributed Message Queue for Streaming Systems: with hands on Experience on Kafka", "type": "Session"}, "347": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "12:30 PM", "end_PT": "01:00 PM", "start_ET": "03:30 PM", "end_ET": "04:00 PM"}, "categories": ["Data Science", "Beginner"], "speakerIds": [66], "description": "The CORD-19 was created to enable AI researchers to create text and data mining tools to help accelerate COVID-19 research. As a key partner in the CORD-19 project, we will introduce what the dataset is, how to link it with an existing academic knowledge graph (KG), and demonstrate how to use this KG-enhanced dataset to generate meaningful insights to help with the fight against COVID-19.", "name": "In Search for a Cure: Explore CORD-19 with Academic Knowledge Graph", "type": "Session"}, "348": {"date": {"start_date": "10/03/20", "end_date": "10/03/20", "start_PT": "12:30 PM", "end_PT": "01:00 PM", "start_ET": "03:30 PM", "end_ET": "04:00 PM"}, "categories": ["Security/Privacy", "Beginner"], "speakerIds": [145], "description": "During these unprecedented times of shifting to a distributed workforce in the light of the Covid-19 pandemic it's important to shed light on the security concerns that surfaced. This shift creates new risks for organizations and opportunities for malicious actors. Now magnify that concern as we attempt to secure the uprising of the work being done to migrate to Cloud technologies, #newnormal.", "name": "COVID-19: The Shift to Distributed Teams and Rapid Increase of Shadow IT in the Cloud", "type": "Session"}}